[{"created_time": "2016-10-27T05:01:00+0000", "story": null, "post_id": "462508190484900_1203225203079858", "message": "#8464 I saw you, redhead hottie with the polkadot backpack walking down the infinite. Your ass looked great in that plaid skirt.", "comments": 2, "reactions": {"like": 1, "love": 1, "haha": 1}, "page_data": {"page_fans": 11767, "page_engaged_users": 2158, "page_views": 3099, "page_consumption": 6714}}, {"created_time": "2016-10-27T04:55:00+0000", "story": null, "post_id": "462508190484900_1203221966413515", "message": "#8453 Guy: *gets blowjob*\nGuy: did u cum babe", "comments": 0, "reactions": {"like": 63, "love": 2, "wow": 1, "haha": 26}, "page_data": {"page_fans": 11767, "page_engaged_users": 2158, "page_views": 3099, "page_consumption": 6714}}, {"created_time": "2016-10-27T04:52:00+0000", "story": null, "post_id": "462508190484900_1203219819747063", "message": "#8452 I recall my first time with a condom, I was 16 or so. I went in to buy a packet of condoms at the pharmacy. There was this beautiful woman assistant behind the counter, and she could see that I was new at it. She handed me the package and asked if I knew how to wear one. I honestly answered, ‘No, this is my first time.’\n\nSo she unwrapped the package, took one out and slipped it over her thumb. She cautioned me to make sure it was on tight and secure. I apparently still looked confused. So, she looked all around the store to see if it was empty. It was empty.\n\n‘Just a minute,’ she said, and walked to the door, and locked it. Taking my hand, she led me into the back room, unbuttoned her blouse and removed it. She unhooked her bra and laid it aside. ‘Do these excite you?’ She asked.\n\nWell, I was so dumb-struck that all I could do was nod my head. She then said it was time to slip the condom on. As I was slipping it on, she dropped her skirt, removed her panties and lay down on a desk.\n\n‘Well, come on’, she said, ‘We don’t have much time.’ So I climbed on her. It was so wonderful, that unfortunately, I could no longer hold back and KAPOWWWWWWWW, I was done within a few moments.\n\nShe looked at me with a bit of a frown. ‘Did you put that condom on?’ she asked.\n\nI said, ‘I sure did,’ and held up my thumb to show her.\n\nShe fainted.", "comments": 11, "reactions": {"like": 57, "love": 2, "wow": 3, "haha": 33}, "page_data": {"page_fans": 11767, "page_engaged_users": 2158, "page_views": 3099, "page_consumption": 6714}}]