[{"created_time": "2018-01-06T04:40:01+0000", "story": null, "post_id": "462508190484900_1652000221535685", "message": "#11406 Websis keeps giving me fatal errors but I'm not emailing the admins cause it's giving me a healthy break from refreshing for grades", "comments": 0, "reactions": {"like": 12}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:40:00+0000", "story": null, "post_id": "462508190484900_1651998991535808", "message": "#11399 @11359 I'm really curious how common this sort of situation is? I feel like I'm in a similar situation (financially, family used to be doing not so great; parents made a lot of sacrifices and never really did anything for themselves in order to get my siblings and I the best education possible throughout our lives; money used to be hella tight;etc. But now, they're doing much better, and we live comfortably, though still without luxuries like trips or a new car and such), but I get excellent aid (tuition covered, and I cover my expenses + housing with work during the semester + my savings). All of my anecdotal experience points to MIT covering the people who need it, and the people I know not on financial aid, well, they live in giant houses and have been flying around the world all their lives; they don't seem to need it as much. Even the people I know who have gotten screwed at first were able to appeal and get things sorted out. Yet, there's been a lot of confessions/comments recently pointing to A LOT of major flaws in the system, and individual cases that were clearly poorly handled by finaid, such as yours.\n\nI'm really curious if there's any sort of complete data/survey information out there that would give a better sense of where these flaws in the system are coming from, and how they could be addressed. Is there some common theme to all these situations that is causing a lot of people to get screwed over? Some sort of anonymized dataset that could show how finaid correlates to income/assets/etc? Does MIT release any of that information? In addition, is there any sort of study that would show if it's more common for people on or off finaid to be going hungry? Is the issue that MIT isn't accounting for every situation, or simply not giving out enough aid across the board? I'm also really curious how the liquid assets of people on or off aid compare after you take out the portion contributed to MIT (or college in general in the case of multiple kids)? this seems like a number that should be fairly similar for most people, excluding those who make far less than the cutoff to start getting less than full aid and those who make far more than that cutoff + the cost of MIT); yet it seems like there's a lot of outliers. It just seems like looking at the data and figuring out exactly where the problem is will provide the best jumping off point for then starting to go to MIT and ask for change.", "comments": 2, "reactions": {"like": 17, "love": 2}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:39:00+0000", "story": null, "post_id": "462508190484900_1651998034869237", "message": "#11394 It's winter; it's cold, weather's gonna be awful, and there's barely any sunlight.\nIt's also cuffing season, but we all know what happens to relationships that start with cuffing season.\nWe should not lose track of the original problem; it's cold, and it's hella more comfortable to cuddle with someone while you're sleeping.\nI propose something similar to DTF; DTC: no-strings-attached platonic cuddling.\nWhat do the masses seriously think?\n\nFor the meantime, hmu at cuddly@mit.edu for pre-alpha testing ;)", "comments": 3, "reactions": {"like": 6, "love": 1, "haha": 3}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:37:00+0000", "story": null, "post_id": "462508190484900_1651994834869557", "message": "#11380 Jacynth, why did you ghost me?", "comments": 7, "reactions": {"like": 3, "wow": 5, "sorry": 1}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:36:00+0000", "story": null, "post_id": "462508190484900_1651994071536300", "message": "#11376 Not sure if I should reach out and Facebook message you again... I've been trying to call you for over an hour. I was so excited to be with you at the beginning of break. You still hold a special place in my heart, but now that I'm so far from MIT and you never respond, all I want is to never see you again. Fuck you Icelandair!", "comments": 0, "reactions": {"like": 4}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:36:00+0000", "story": null, "post_id": "462508190484900_1651993588203015", "message": "#11373 Maybe I'm insecure, but every time I hear \"I love you\" from you I always question if you really mean it.", "comments": 3, "reactions": {"like": 2, "sorry": 9}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}, {"created_time": "2018-01-06T04:36:00+0000", "story": null, "post_id": "462508190484900_1651993701536337", "message": "#11374 When you're waiting to get back from break to confess your love for someone so until then the affection just bursts in your heart <3", "comments": 4, "reactions": {"like": 13, "love": 19, "haha": 1}, "page_data": {"page_fans": 19148, "page_engaged_users": 5415, "page_views": 6738, "page_consumption": 30075}}]