[{"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604948736240834", "message": "#10017 Frankly, I feel strongest about her when I'm fuzzing out at 4 AM and getting sick from work. We communicate mostly when we run into each other late online - like ships without radios, blind in the night. We put up flares of sheer panic when we're in danger of failure, or blinking spotlights to signal on conditions. MIT has become a little bit of a private hell (my fault, for sure) and she’s based somewhere very far away. I’m sure she doesn’t get any special psychic payback from our friendship. But for me, all this is partly bearable because of her...", "comments": 0, "reactions": {"like": 3, "love": 3}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}, {"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604944846241223", "message": "#10008 I say alarming things when I’m drunk and people think I’m being dramatic but I actually am asking for help since I’m not filtering my thoughts anymore", "comments": 4, "reactions": {"like": 5, "sorry": 1}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}, {"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604943309574710", "message": "#10005 I have a friend who used to have a heart of gold, and used to be one of the sweetest people I've ever known. Some shit happened to her this summer that changed her world view, and ever since she's become really cold and reserved at times. I miss my old friend, but I know that healing and learning how to trust people again take time, and I'll be there for her through her bad months and good months -- always. \nIf you're reading this, which you probably are since you check MIT confessions a lot (lawlz), just know that I love you and am here for you as a friend no matter what you're going through. Stay strong.", "comments": 3, "reactions": {"like": 28, "love": 9, "wow": 1, "sorry": 9}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}, {"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604939189575122", "message": "#9999 I feel terrible for being this way, but honestly I can't stand being around my classmates that are happier/more successful than me. Of course I am happy for them and I cheer them on but I just want to feel some of that happiness/success for myself as well. I cheer on these people all the time but never have anyone do the same for me even once. And it's not that I cheer others on because I expect the same in return, but because I really do believe in them. I guess people don't bother with me because I cheer on others so much that they think I cheer on myself? I've gotten to the point where I am unfollowing people on social media and avoiding them in real life to stop being constantly reminded of how inadequate and useless I am. I literally spend every waking moment of the day studying and working and still just barely getting by. All I want is to not just feel like my only purpose in life is to be someone else's expendable mascot.", "comments": 4, "reactions": {"like": 26, "sorry": 25}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}, {"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604948386240869", "message": "#10015 I dream about making a machine that converts my life energy into energy for everyone else to use because there is no sense in me living.  I even feel guilty eating in the dining hall because I am taking away energy from all of you guys who deserve to live so much more because you are going to contribute something worthwhile and beautiful to the world. The only people I am close with are my family, and quite frankly, we can go in a closet and play russian roulette with enough bullets for all of us because we are loners who don't matter.", "comments": 1, "reactions": {"like": 2, "wow": 1, "sorry": 18}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}, {"created_time": "2017-11-21T13:00:00+0000", "story": null, "post_id": "462508190484900_1604947479574293", "message": "#10013 @9911 I promised I'll stay, and I'll keep that promise.\n\n[@9911 Please stay]", "comments": 0, "reactions": {"haha": 1}, "page_data": {"page_fans": 18412, "page_engaged_users": 4324, "page_views": 4971, "page_consumption": 19068}}]