[{"created_time": "2015-09-23T14:10:55+0000", "story": null, "post_id": "462508190484900_949065595162488", "message": "#1838 I've never watched Star Wars...and I have no interest to", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:09:36+0000", "story": null, "post_id": "462508190484900_949065101829204", "message": "#1833 Got dumped by a significant other recently, and I thought I'd still be upset. But well over a dozen people have independently come up to me to let me know what an awful personality he had and that they're glad he doesn't come to events with me anymore. I know this is an unhealthy thought, but man, what a way to heal.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:08:42+0000", "story": null, "post_id": "462508190484900_949064848495896", "message": "#1830 To the weirdo guy who posted that he is \"frightened\" by what girls here do with boys. What is your problem? Why are you so cut up about it? I think it's awesome! If a girl wants to do \"Caligula style acts\" good for her. In fact I think I'll be joining. If a women wants to take more loads then a 25 cent washing machine that's none of your business. Why don't you worry about your own problems, like the fact that you are upset that nobody wants to give you the shocker while giving you head.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:08:27+0000", "story": null, "post_id": "462508190484900_949064765162571", "message": "#1829 I'm so ashamed of myself but I have a huge crush on Chris Columbo. I catch glimpses of him in the Infinite sometimes and I get butterflies. Every time I hear people saying that they don't like him or that they're glad he's stepping down, I feel this mixture of anger and embarrassment. I just want this to go away. Please tell me that someone else feels like this.", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:08:09+0000", "story": null, "post_id": "462508190484900_949064718495909", "message": "#1828 I think we should rename this page MIT complaints.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:07:25+0000", "story": null, "post_id": "462508190484900_949064431829271", "message": "#1825 Earlier I posted a confession about the level of sexual acts I have witnessed here. I want to anonymously address two comments there which addressed good points.\n\nOne asked if I felt that a womans value only came from her sexual history and willingness. The other asked why I was talking about the women and not the men involved. The reason I choose to address women is because I feel this is an issue that harms women the most. To the women here I will be completely honest with you. The harsh reality is, in our society you have very little power as a whole. Men hold most of it. Sex is one of the few areas you can say no to definitively. Power is the ability to say no. The second you give that up, you lose power. This is not going to change anytime soon. Men have sex for very different reasons then you do. Women for the most part see it as the beginning of developing an emotional bond. Men simply see it as a recreational activity. Sex may be an act of love and fun for women, but for men it's an act of power, control, recreation, and in some negative circumstances, violence. Men tend to get into relationships and marriage for regular guaranteed sex, not so much the emotional bonds that women get into relationships for.\n\nTo answer the question of the value of women, no a woman's intrinsic human value is not based on sexual history. Unfortunately for men, her value as a partner in a relationship is. And guilt tripping men trying to tell them to change millions of years of gut instinct is not going to help. What I am recommending to women is to wait for a committed relationship. You have to make your partner wait, treat you well, and value you, and work for you physically. People value scarcity. And the key to dealing with the power dynamic of sex is to get the guy to commit then get sex. That way even though you have submitted and relinquished sex, he has submitted and relinquished some of his freedom. That way even though you have given up the sexual power, he still respects you and treats you well.", "comments": 29, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-23T14:07:03+0000", "story": null, "post_id": "462508190484900_949064338495947", "message": "#1824 I'm a freshman and I feel like I'm struggling badly in all my classes and will never catch up...Does everyone feel like this at some point...", "comments": 13, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]