[{"created_time": "2018-05-16T17:36:00+0000", "story": null, "post_id": "462508190484900_1786625628073143", "message": "#13632 Here's a sad sad story about my sad sad life: I had a big presentation for a CI-M a bit ago, and the dress code was business casual. I hadn't slept the night before, and looked like absolute garbage. But, I dressed up and put on make-up to try to make myself look like a human. I was putting on eyeliner, and smudged it a little, so tried to wipe off the dark spot under my eye. It took me a couple minutes to realize the dark smudge wasn't eyeliner, it was just bags under my eyes.", "comments": 5, "reactions": {"like": 16, "love": 2, "haha": 1, "sorry": 32}, "page_data": {"page_fans": 24331, "page_engaged_users": 1292, "page_views": 1412, "page_consumption": 3432}}, {"created_time": "2018-05-16T17:35:00+0000", "story": null, "post_id": "462508190484900_1786625214739851", "message": "#13630 I can't seem to do anything right. My grades are embarrassing. Everyone else makes getting internships so easy, but I failed every technical interview so far. It's so frustrating and discouraging. I try so hard, only to fail again. What am I doing wrong?", "comments": 3, "reactions": {"like": 7, "sorry": 6}, "page_data": {"page_fans": 24331, "page_engaged_users": 1292, "page_views": 1412, "page_consumption": 3432}}, {"created_time": "2018-05-16T17:34:00+0000", "story": null, "post_id": "462508190484900_1786624751406564", "message": "#13627 I'm tired of all these \"I shouldn't have been hospitalized, they had no right to do this, don't seek help because you'll be sent to a mental hospital, etc\". First of all, if you're sent to the hospital it's because a professional believes that you cannot keep yourself safe and whether you expressed that to them or not, professionals are trained to recognize when the situation is getting out of hand. Nobody likes going to the mental hospital; my experience was also stressful but I also didn't kill myself and that's the whole point. Spending a few days in the hospital where you can just forget about everything else and be taken care of, even if it is scary and not great or you don't want to be there, it's worth it if you come out ok. Often, it's difficult for people to have an objective understanding of how bad the situation is. It's like waiting so long before asking for help that first time because you've convinced yourself that you're ok for so long - it takes a while to get through your anger and frustration before you can come to terms with the fact that maybe you did need to be there and that professionals don't send patients away willy nilly.", "comments": 3, "reactions": {"like": 19, "anger": 4}, "page_data": {"page_fans": 24331, "page_engaged_users": 1292, "page_views": 1412, "page_consumption": 3432}}]