[{"created_time": "2015-09-25T13:58:37+0000", "story": null, "post_id": "462508190484900_949904508411930", "message": "#1865 I was reading some [census] figures and trends the other day that disturbed me. I have always been a proud atheist, and a activist for atheists. I looked at the US birth rates. Secular and atheist birthrates are the lowest, and well below sustainability. Fertility for atheist women is about 1.5 children, hardcore religious, 2.5 - 6 per woman! Meaning the next generation of atheists will be smaller. Meanwhile the hardcore religious have the highest birthrates of all. The amish, mormons, devout Catholics, evangicals, all breed like rabbits. In the last 20 years the amish population has TRIPLED from birthrates alone. Immigrants here also tend to be more religious. If this continues in a couple generations we will go from a nation making secular progress back to a religious hive on the level of a middle eastern nation. So I urge all my fellow atheists and secular members, please make a point to have more children and raise them atheists. A good number to be safe is 3 or 4 children per couple to insure atheist population growth. I'm terrified to live in a world full of religious fanatics in a couple generations.", "comments": 19, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:57:09+0000", "story": null, "post_id": "462508190484900_949903751745339", "message": "#1860 two weeks into the semester and already feeling crushed by stress and anxiety", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:56:57+0000", "story": null, "post_id": "462508190484900_949903635078684", "message": "#1859 The raging debates about sexuality on MIT Confessions seems pretty silly to someone who's never had the opportunity or choice and is about to graduate a virgin and will likely remain a basement-dwelling permavirgin. Wizard powers, here I come!", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:56:34+0000", "story": null, "post_id": "462508190484900_949903161745398", "message": "#1857 I hate when people are so enthralled about bullshit computer security debates.  It feels like most of MIT cares more about idealism and technology than about others' day to day struggles and feelings.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:56:12+0000", "story": null, "post_id": "462508190484900_949902981745416", "message": "#1855 You were my crutch when I needed help standing up, and when you left, you turned me into a cripple. Pathetic, right?", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:51+0000", "story": null, "post_id": "462508190484900_949902858412095", "message": "#1854 THE NEW STELLAR IS FREAKING CONFUSING!!!!!", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:39+0000", "story": null, "post_id": "462508190484900_949902511745463", "message": "#1853 Goal of the week, try this pickup line on a hot CS major. \"Hey girl, you may be object oriented, but I would never override your methods.\"", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:30+0000", "story": null, "post_id": "462508190484900_949902331745481", "message": "#1852 Who here has ever been personally victimized by Regina George?", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:21+0000", "story": null, "post_id": "462508190484900_949902215078826", "message": "#1851 I had a friend as about my relationship. I'm in an S&M one with my gf. I play the master, she plays the slave role. He could not understand why we both liked it. Then the more I thought about it, the more I realized that although it was obvious to me, many people didn't get it. So I'll say why we like it. My gf gets stressed and for her giving up all control and being forced into pain is comforting and relaxing. Like all couples we have arguments and can get angry, for me the sadistic role is a good outlet to unleash my anger in a controlled way. Once I'm done being rough S&M with her, I'll then be very gentle, the sudden change from brutal to gentle is very relaxing for her and makes the gentle touch feel so much better.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:11+0000", "story": null, "post_id": "462508190484900_949902101745504", "message": "#1850 I really want to have sex in a public place, the risk of getting caught is exciting!", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:55:00+0000", "story": null, "post_id": "462508190484900_949901841745530", "message": "#1849 The sex positive movement is fantastic, but it still has a ways to go before it accepts me and my penis. As it currently stands, nobody’s heart is big enough, and nobody’s mind is open enough, to accommodate the Satanic belch of a nighttime labyrinth that I have between my legs.", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-25T13:53:29+0000", "story": null, "post_id": "462508190484900_949900381745676", "message": "#1841 I fell in love with the post-doc I worked with in my UROP. No, I didn't just have a crush on him, I fell legitimately in love with this guy. He was married. He had children. Did that stop my idiot brain? NOPE. \"Lucky\" for me he left MIT. I have been numb for going on four months now...My life is so much better this way.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]