[{"created_time": "2015-09-17T20:02:52+0000", "story": null, "post_id": "462508190484900_945936488808732", "message": "#1819 I just want a roommate I can talk to about jerking off, lifting, and The Weeknd. Am I asking for too much?", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:02:45+0000", "story": null, "post_id": "462508190484900_945936388808742", "message": "#1818 Am I the only person who got screwed over by MIT Housing this year? Because I'm pretty homeless right now...", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:02:34+0000", "story": null, "post_id": "462508190484900_945936332142081", "message": "#1817 I had some BS happen in highschool when I applied here. Background. My dad is white and my mom is half black half white. So I'm 3/4 white and 1/4 black. I'm pale, you can tell I'm part black when I grow my hair out but I tend to keep it short and everyone who doesn't know me assumes I'm a tan white guy, and usually they guess I'm Italian. When I applied my guidance counselor who was white tried to get me to put down black as my race. I pointed out that I look white and am mostly white so white made the most sense. He persisted and made the argument that I've had a \"tough time\" as a \"person of color\" in life, so I should do it to \"help ease the admissions process\". I'm from a rich Jewish long island suburb I've been very fortunate. So I want to say to all white people out there who I one of, black people are not your little pity cases. Doing someone a favor for no reason other then them being black is condescending. Stop trying to be a white savior. If you really want to help black people then stop trying to tell them what race they are and that they are victims. I'm not a victim, maybe some of my ancestors were, but I'm far from it, I'll pull myself up by my own bootstraps.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:01:41+0000", "story": null, "post_id": "462508190484900_945936045475443", "message": "#1813 As a guy I am actually frightened by how much girls seem to be willing to do sexually. Granted, I have only my own narrow spectrum. I talked to my dad about what girls are willingly to do now and he was baffled. He talked about coming here in the 60's and how back then you didn't even get into bed with most girls until you were married or you promised her marriage. The reason it concerns me is how I'm honestly not sure how a lot of guys are going to be able to have normal relationships with one woman after getting Caligula style acts from various women. I'll admit it was really hard for me to settle down with one girl now. Guys, it is honestly worth it, but you have to train yourself to enjoy it.", "comments": 10, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:01:31+0000", "story": null, "post_id": "462508190484900_945936008808780", "message": "#1812 I used to be the epitome of a wigger. Rich white boy with the stupid outfits, fake accent, and slang. Looking back the reason I did it was because I thought it was cool and made me a man. Then I learned the first rule of being cool, you can't be cool if you are trying to be cool.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:01:23+0000", "story": null, "post_id": "462508190484900_945935955475452", "message": "#1811 I don't find Tom Brady sexy.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-17T20:00:50+0000", "story": null, "post_id": "462508190484900_945935772142137", "message": "#1808 Who the fuck is this Francois Jabbour kid?", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]