[{"created_time": "2015-10-31T21:14:05+0000", "story": null, "post_id": "462508190484900_964533943615653", "message": "#2405 For a lot of time at MIT I have lived under the pressure so as not to say anything racist. The statements, which in my opinion, are objective facts about features and behavior types of certain racial groups, seem to be considered racist in the US. Like, admitting the fact that the volume of noise of Chocolate House people is intimidating to me as a person from a quieter culture is a racist statement. Admitting the fact that racial proportion at MIT is an outcome of a fair competition based on SAT scores and other objective criteria and hence concluding that certain groups should just merely study harder is racist. Admitting the fact that yes, walking home too late at night (2am), I feel more scared about one racial group representative compared to another, just based on MIT criminal bulletin announcements racial stats is racist. \nWTF? \n\nI come from a country with multiple ethnicities with significant differences between each other. Acknowledgment these differences publicly in the form statements above and jokes is OK, since people there seem to have objectivity sense and sense of humor. This calm attitude seems to be based on the fact that no ethnic group feels endangered and hence takes these statements/jokes seriously. Wonder why here there is so much reaction here.", "comments": 8, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-31T21:13:51+0000", "story": null, "post_id": "462508190484900_964533893615658", "message": "#2404 Is there a libertarian/conservative/republican club on campus that's still alive?  The 2 or 3 I've sent emails to have never replied. :/", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-31T21:13:38+0000", "story": null, "post_id": "462508190484900_964533823615665", "message": "#2403 When your major apparently can't afford individual tutors but the Institvte has enough money to kill the Kresge grass, dig it up, block it off, roll it out and kill it again...every...other...week. When the grass is new again, I walk on it out of hatred. #I'llStopWalkingOnTheGrassIfYouGetMeATutor", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-31T21:13:11+0000", "story": null, "post_id": "462508190484900_964533726949008", "message": "#2401 I really loved my living group when I first got to MIT, but this year I feel really disconnected with the people here. I'm the type of person who likes to hang out at home, so it's been really lonely for me. I want to switch dorms but feel as though it may be too late to make friends in a new place (I'm a Sophomore). How welcoming do you think your dorm or living group would be to a new person like me? Would you recommend moving there? I'm really just looking for a welcoming place where the residents like to spend time together. Thanks! :)", "comments": 10, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-31T21:12:34+0000", "story": null, "post_id": "462508190484900_964533590282355", "message": "#2398 I really want to go to parties and sleep with people, but I have no idea how people hear about parties. Are there mailing lists I can add myself to or something?", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-31T21:12:05+0000", "story": null, "post_id": "462508190484900_964533453615702", "message": "#2396 I bet I can get this post approved through Jedi mind tricks.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]