[{"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634134823322225", "message": "#10769 Yo, crush.mit.edu is bullshit. I have crushes on people and their names don't even come up. Like wtf are you saying? These people don't even exist? So much for being a site for spreading love. FU", "comments": 3, "reactions": {"like": 2}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634131606655880", "message": "#10745 Having mixed feeling about making out with those EC sophomore guys last night...they were both hot but this makes me “that” alum and I feel so old......but being told you taste good is always a plus.", "comments": 0, "reactions": {"like": 4, "wow": 1}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634135893322118", "message": "#10775 I know your super wild, in a prodigious way, and that your girlfriends are dudes, but some of us have a thing for you and since you're amazingly charming to all of us we are befuddled by your kind gestures.  I believe I have misinterpreted your friendship and I'm broken hearted by it. I must say there are many things about you that make you stand out from any other girls I have met. I don't know where you get that spirit, energy and love for life. I enjoy how you bring laughter and great conversation to the table. As difficult as it is to write, only because I care for you, as a friend I suggest you focus on the serious candidates and stop spreading yourself thinly amongst the amount of guy friends that you have. I guarantee you these lucky guys who have an opportunity to call you theirs have mixed emotions with your actions towards all your other friends. Guys are guys, they like to talk and would not like for your rep to be attacked. I know you are not about that one bit, and you deserve to be respected, which I would totally do if you had me, but as a friend I would like for you to be more cautious. Trust me, the guy friends you have now will continue  to be your friends because you're you. I for one are one of those friends. Maybe someday you will see me in the same way I see you. If your perspective crushes don't see what a diamond you are, they are absolute tomfools. I for sure see the radiant light that you emit. Only a few days left before you leave and it sucks you won't be around for six weeks, but I can't wait to hear about your travels to San Diego and Israel. I'll anxiously be awaiting your return.", "comments": 7, "reactions": {"like": 5, "love": 2, "wow": 1, "haha": 5}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634133729989001", "message": "#10762 I gotta say that I'm addicted to the adrenaline rush that you get when you try to cram 500 slides in 3 hours before the exam.", "comments": 13, "reactions": {"like": 112, "love": 5, "haha": 19, "sorry": 10}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634133796655661", "message": "#10763 How do I tell a company I want to machine learn in someone else's cloud :(", "comments": 5, "reactions": {"like": 17, "love": 1, "wow": 3, "haha": 4, "sorry": 2}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634135299988844", "message": "#10771 So I thought I was retarded, turns out just dyslexic.", "comments": 2, "reactions": {"like": 6, "love": 3, "sorry": 4}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634136026655438", "message": "#10776 One of the first guys I met when I came here was Elian Malkin during orientation and REX activities. That accent. That face. I think we had a chance of being good friends. Unfortunately  I have not had the opportunity to see him again since and I don't think I ever will. And even if I do, I will be too shy to approach him. I just remembered him because I saw him comment on a post on Facebook. Stay beautiful.", "comments": 8, "reactions": {"like": 18, "wow": 4}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634133489989025", "message": "#10759 If MacG had a clothing optional entry, I would switch immediately, just saying", "comments": 12, "reactions": {"like": 13, "love": 1, "wow": 1, "haha": 4}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634131743322533", "message": "#10746 20.110 TA Catherine is bae I have such a girl crush on her omg", "comments": 3, "reactions": {"like": 12, "love": 5}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634132923322415", "message": "#10756 One of the things that makes me really sad is when I read people write things like \"*place* has been where I met my friend and community etc etc\" because I realize that I have never experienced this. I've never been able to go somewhere where I blossomed and found true loving companionship, and it makes me endlessly jealous to see that other people have had such fun formative experiences, especially when they met their significant others through said experiences.", "comments": 1, "reactions": {"like": 7, "love": 3, "wow": 1, "sorry": 11}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}, {"created_time": "2017-12-19T05:59:00+0000", "story": null, "post_id": "462508190484900_1634132723322435", "message": "#10754 Harvard and MIT remind of Messi and Cristiano. Harvard is like Cristiano: Richer, more famous, more marketable and more braggadocious. MIT is like MESSI: still famous but less well-known, more low profile and humble. Like in the case of Messi and Cristiano, people argue who's the better between the two.", "comments": 20, "reactions": {"like": 72, "love": 12, "wow": 1, "haha": 19}, "page_data": {"page_fans": 18792, "page_engaged_users": 5504, "page_views": 7019, "page_consumption": 31187}}]