[{"created_time": "2015-12-18T00:51:41+0000", "story": null, "post_id": "462508190484900_985312664871114", "message": "#3428 part of me is amused, but most of me doesn't know how to feel about the fact that no one in my hall, despite all the hints I tried to drop, noticed how suicidal or depressed I was from the last half of the semester all the way up until the day I left for winter break. I love you guys, but fuck you guys. at least I made it this far", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:51:07+0000", "story": null, "post_id": "462508190484900_985312574871123", "message": "#3426 Everyone at MIT just wants a prestigious internship or a successful startup, but all I want is a girl with a short skirt and a long jacket :(", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:50:29+0000", "story": null, "post_id": "462508190484900_985312401537807", "message": "#3425 I walked in on a former Basketball player pleasuring himself with his musical instruments", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:50:13+0000", "story": null, "post_id": "462508190484900_985312341537813", "message": "#3424 I walked in on two former Football players having sex in their apartment", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:45:53+0000", "story": null, "post_id": "462508190484900_985311248204589", "message": "#3410 You know you've done the semester right when your professor says \"It's nice to finally meet you\" as you turn in your final exam.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:45:40+0000", "story": null, "post_id": "462508190484900_985311168204597", "message": "#3409 Today I remembered why I loved Senior Haus in the first place. It's easy to forget, constantly seeing so many cold, spiky exteriors that are just shells hiding all these beautiful people. But it's such a community, with the silverware/food/couch/everything kleptos; we all live together like a family and send out angry/threatening/'stop taking my red sweater get your own and grow up damn it' emails like a dysfunctional family. \nI was reading MIT confessions and I saw the hatred for the Burton-Connor lady and then there was the Senior Haus confession. We lovingly tease our housemaster and AD and house manager; I have yet to see any actual tension arise between residents and the house team (except in the case of Ken meets fire hazard but that's more of a Ken-fire-hazard personal issue) and it's one of the few things that truly make finals week significantly better. \nSeeing the stark contrast between how we feel about our house team and the BC people, how many haus people respond to haus confessions in fun ways, it hits home that the reason I'm still here is because there's no other place that I could imagine being even relatively happy. I'd rather be holed up in my room psetting/studying 80% of the day here than anywhere else because, at the end of the day, yes, it is the most unique place I've ever seen.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-18T00:44:54+0000", "story": null, "post_id": "462508190484900_985311028204611", "message": "#3406 SIGHH the struggles are real when your crush says \"i think of you as a sister\" T_T is the siblingzone even a thing", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]