[{"created_time": "2015-11-22T22:24:12+0000", "story": null, "post_id": "462508190484900_973735476028833", "message": "#2906 I went commando at ring delivery", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:24:05+0000", "story": null, "post_id": "462508190484900_973735396028841", "message": "#2905 I always compose my responses to over-the-text heated arguments beforehand because I know exactly what my friends are going to say, and then I challenge myself to copy, paste, and send them immediately after my friends reply, and before they manage to type any other message.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:23:47+0000", "story": null, "post_id": "462508190484900_973735269362187", "message": "#2904 I want to die. I want to give up and go away. I want to reach out to people because I'm so lonely but I've been crying alone in my room for all of the weekend. I don't want to bother someone with my worthless problems. There's people that I want to talk to because they make me smile but we only talk at sport practice and I don't want to bother them. I want so badly to reach out to them but I'm so terrified of the rejection. I'm sick to my stomach and I'm so close to regressing back into self harm and suicide. I'm so sorry I'm so pathetic and worthless", "comments": 11, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:22:28+0000", "story": null, "post_id": "462508190484900_973734909362223", "message": "#2896 I am secretly trying to recover from an eating disorder alone, but to other people it just looks like I'm gaining my 'Freshman 15', and having to deal with both the weight gain and the misunderstanding just fucking hurts.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:21:57+0000", "story": null, "post_id": "462508190484900_973734762695571", "message": "#2893 I'm sick of seeing all these support networks pop up. Along with all of these people \"there to talk\" if you're depressed. Maybe if you just made friends and talked to them like normal people, everyone wouldn't need support all the time.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:21:35+0000", "story": null, "post_id": "462508190484900_973734682695579", "message": "#2890 I feel like the question of Syrian refugees is simple, but not in the way I see some people breaking it down. The choice as I see it is A) Does the US accept the refugees, knowing it is likely that some percentage of them will be malicious agents taking advantage of the crisis to immigrate, or B) Does the US accept none of them (or perhaps a third option, does the US accept a subset that is likely to be harmless? Eg. children only, though that would be heartbreaking for those families and not necessarily the best option for those children, etc.).\n\nTo argue that innocent refugees should be welcomed because they're decent human beings is to argue against a straw man (Well, it may SHOULD be arguing against a straw man, though some politicians' comments seem to indicate they might actually be opposed to this sentiment...). If governments had divining rods that could tell who was and wasn't intending to perpetrate violence on others, this decision would be much more straightforward.\n\nI just wanted to articulate this distinction. I think it's very possible to be in favor of A) above; but the proper articulation is \"I support accepting all of the refugees, because helping the innocent ones is more important than preventing the damage that might be caused by the malicious agents\", not simply \"I support welcoming Syrians\". (Does this sound accurate to people? I am by zero means a domain expert, here)", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:21:16+0000", "story": null, "post_id": "462508190484900_973734596028921", "message": "#2888 The biggest regret of my life is treating you like shit. I loved you so much, but I don't know why it was so hard for me to show you. You've been gone for so long now, but hearing how you pretend to not know of me hurts a shit ton. I still have the fondest of memories of you, and I know those won't fade for a long time. I guess I just thought that was kind of mutual. \n\nRegardless of what you think of me, I will always see you as the love of my life. It's too bad you don't know what the good old days are until they're over.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-22T22:20:37+0000", "story": null, "post_id": "462508190484900_973734359362278", "message": "#2884 Recently I've been coping with being single and lonely by remembering that my ex never approved of me singing This Day Aria during skype dates.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]