[{"created_time": "2015-12-01T23:56:36+0000", "story": null, "post_id": "462508190484900_977826222286425", "message": "#3070 Why did the ISO move so far away?? It's also one of the few offices left with only paper forms.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:56:24+0000", "story": null, "post_id": "462508190484900_977826165619764", "message": "#3069 I feel like the only people who get into selective programs are the people who applied last-minute, and who don't really care about it. I feel like these programs reward people who are good at BS-ing.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:55:31+0000", "story": null, "post_id": "462508190484900_977825778953136", "message": "#3066 I'm so good at crying without sounds that even my roommate who sits 6ft away from me can't notice it as long as I hide my face. Just some raindrops running down my face. I just really can't deal with crying in front of people, but I cannot stop those tears from falling when life is burning me out. Bur all will get washed away, and I'll start the next day strong again.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:54:18+0000", "story": null, "post_id": "462508190484900_977825428953171", "message": "#3062 I'm a 5'2\" guy, which has given me crippling social anxiety. Why should I even try living anymore? There's just no hope.", "comments": 13, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:53:44+0000", "story": null, "post_id": "462508190484900_977825228953191", "message": "#3059 Really happy because I just started getting my life together. Did laundry, cleaned my room + dishes, and I'm even trying to stay caught up on work for the week #aboutgoddamntime", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:53:18+0000", "story": null, "post_id": "462508190484900_977825115619869", "message": "#3057 I had a dream that I was walking around in Stata completely naked, because in the dream everyone at MIT had decided that they were okay with public nudity. Then I saw someone from my high school who doesn't go here and he asked me \"do you have any clothes?\" and I calmly replied \"Not at all\" and walked away.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:51:50+0000", "story": null, "post_id": "462508190484900_977824728953241", "message": "#3050 Fuck people who charge for food and alcohol after social events without telling people beforehand they were going to have to pay for it", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-01T23:51:13+0000", "story": null, "post_id": "462508190484900_977824605619920", "message": "#3048 I've never gotten a B before in my life. Not before MIT, and not even at MIT. I work hard, but I also realize how fortunate I have a natural ability to do well in school. I may take for granted sometimes my intelligence, but I never forget even for one second that there are other students that work twice as hard as I do and still aren't able to pass classes.\n\nWith this in mind, it really bothers me when someone does poorly on a test and when I try to console them or encourage them that they can do better next time, they never take me seriously. They tell me \"you couldn't understand, you've never failed a test before in your life\". They tell me, \"even when you think you've done badly, you still usually beat the average\". \n\nSince when does doing better than other people define whether we're doing well? Why can't I feel as if I've done poorly if I didn't live up to my potential, no matter how far above or below average I was? It's not about doing better than other people, it's about doing better than you think that you can do.\n\nAnd even more, since when does our grades define the quality of our lives? Just because I've never failed a test doesn't mean that I don't know what it means to fail, to be disappointed in myself, or to face hardships.\n\nI guess I just wish that people would realize that when I say that I know that they can overcome this, and that it will be ok, they're not empty words. I mean every one of them because I've been there too, even if I never show it.", "comments": 11, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]