[{"created_time": "2015-11-16T17:07:21+0000", "story": null, "post_id": "462508190484900_971094682959579", "message": "#2767 I grew up in an urban area in a conservative state in a family that was indifferent to LGBT issues. With essentially no direct guidance either for or against I took what I thought was the right and decent path, support. I would read about persecution and side on the side of human rights equality and feel pleased with myself that I was on the right side of history. However, I was never exposed to many openly LGBT people in my conservative state and, having been exposed now to those people and the everyday problems they face, I realize that despite best efforts I committed many micro-aggressions and showed a lack of empathy before. I'd like to think that I'm changed now and I'm sure that most people would be satisfied that I had recognized what I was doing wrong and was making active efforts to change my behaviour and be more welcoming, but it bothers me that the nights I spent thinking about what I believed in and trying to be supportive of all people were not enough.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-16T17:04:03+0000", "story": null, "post_id": "462508190484900_971093756293005", "message": "#2754 I hit myself over and over until I bruise.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-16T17:03:34+0000", "story": null, "post_id": "462508190484900_971093599626354", "message": "#2751 Moral high-handedness on this page. You read a confession and you can predict the comments (and sometimes who) below.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-16T17:02:07+0000", "story": null, "post_id": "462508190484900_971093082959739", "message": "#2742 I keep seeing people post statuses in French. Honestly, what the fuck. Are you mourning the loss of 100+ French lives or are you just using this as an excuse to brag that you know French?", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]