[{"created_time": "2015-10-12T17:16:19+0000", "story": null, "post_id": "462508190484900_956448421090872", "message": "#1961 I have tally marks on my wall for days I've seriously considered suicide. If someone asks about it, I say I forgot what its for. The frequency has gone done since coming here.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:15:28+0000", "story": null, "post_id": "462508190484900_956448051090909", "message": "#1958 We lock eyes in 9.75. I want you. Boo's cruise 2015", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:14:41+0000", "story": null, "post_id": "462508190484900_956447794424268", "message": "#1955 My grades are too high. I feel like I'm wasting P/NR.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:13:41+0000", "story": null, "post_id": "462508190484900_956447487757632", "message": "#1952 If I had the power, I'd ban any assignments from being due Friday at 5pm through Monday at 9am. I'd also ban anything being due between 12 am and 9 am. At least then we'd all be able to pretend we have lives outside of MIT.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:12:45+0000", "story": null, "post_id": "462508190484900_956447187757662", "message": "#1949 who says that you're from MIT and you don't need to worry about getting a job at all...biggest lie ever...", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:11:06+0000", "story": null, "post_id": "462508190484900_956446611091053", "message": "#1943 Maybe I'm way off on this, but am I the only one who thinks it's totally insane that the vast majority of exams here are closed book? I've yet to be able to think of a time where one would ever have to do anything without being able to consult notes, textbooks, etc. outside of the completely fabricated situation that is a closed book exam. I guess you wouldn't be able to look at your notes if you were stranded on a desert island or something, but I can't imagine that that's what we're being prepared for. Why do I have to waste so much time making sure I remember formulas, definitions, etc. out of fear that forgetting one small thing could leave me unable to do an entire problem when in real life I'd be able to just quickly look up anything I couldn't remember at the moment and continue on? The only argument I can see against open book exams is that students may just show up for the exams without learning the material, but I'd argue that if you can essentially teach yourself a subject and complete a 50 minute exam in 50 minutes and get a good grade then you deserve it.", "comments": 7, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:10:56+0000", "story": null, "post_id": "462508190484900_956446557757725", "message": "#1942 PSA: For those that are frustrated by the busy human highway that is the infinite corridor, fear not. There exists a parallel universe: a one where an identical infinite corridor is bestowed upon mankind; namely, in the basement and second and third levels. The wormholes to these multiverses are located conveniently on the two ends and along the entire corridor length. Use liberally to fast forward the unpleasant jungle of human beings on level one during rush hour.", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:09:46+0000", "story": null, "post_id": "462508190484900_956446044424443", "message": "#1938 What I've learned is that when two people are fighting, the one who cries first, the loudest, and the most is always perceived as the victim. \n\nSo before you take sides in someone else's business, get to know both sides.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:08:49+0000", "story": null, "post_id": "462508190484900_956445711091143", "message": "#1934 I feel like a memo was sent out to all MIT professors telling them to call their exams \"quizzes\" in order to reduce stress. You're not fooling anybody, MIT.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:08:40+0000", "story": null, "post_id": "462508190484900_956445637757817", "message": "#1933 That other guy vouching against gun control makes us all look bad.  I don't want to hurt anyone, I don't want more mass shootings, I'm fine with more stringent background checks, waiting periods, etc. (The NICS system needs an overhaul/replacement) and most of the people I've talked to in the gun-owning community feels the same way.\n\nNobody wants more deaths, truly.  We just want to fix this problem and no two people can agree on how it should be done.  I look to Switzerland as an example.  They have lots of guns but a nice low crime rate, because they're doing it right.  The U.S. has some serious problems in comparison.\n\nIn the meantime, I just want to secure my right to shoot at pieces of paper in an indoor environment with my expensive toy.  I don't want to hurt anyone.  If I have to go through a week-long waiting period or a more stringent background check, take government-mandated classes, etc. to prevent some shootings?  Totally, I'd have no issues with that.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:07:50+0000", "story": null, "post_id": "462508190484900_956445331091181", "message": "#1929 I love having a sink in my room. I don't have to use tissues to masturbate anymore", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:07:39+0000", "story": null, "post_id": "462508190484900_956445281091186", "message": "#1928 Coming from an Asian, people telling me they have yellow fever is a HUGE turn off....", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-12T17:07:22+0000", "story": null, "post_id": "462508190484900_956445161091198", "message": "#1926 i realized that i needed glasses when i couldn't focus my microscope in lab", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]