[{"created_time": "2015-10-27T01:54:29+0000", "story": null, "post_id": "462508190484900_962512647151116", "message": "#2285 That John Cena confession might have been the last solid post on here.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:52:46+0000", "story": null, "post_id": "462508190484900_962512123817835", "message": "#2281 A lot of people here were their high school's valedictorian and now they come to a place like MIT and realize that they are no longer the best - they may be below average or maybe even average.  And this makes them feel awful but their friends tell them \"you are below average at a top university - you are still above average in a grand sense.\"  I also see this ALL the time in comments on this page.\n\nWhile this *may* be true (I don't 100% believe that, after all STEM !> humanities), it just seems to be a super weird thing to say.  Why is your \"confidence\" based on being better than other people?  Sometimes it is super annoying to work with another MIT student at a company because they often look their noses down at kids from other colleges and they refuse to learn from them.  Like stop.  Stop getting your self worth from being better than other people.  Sometimes you aren't the best.  And that's okay.\n\nI have an older sister who is a freaking prodigy so I had to learn this lesson super young.  I would sometimes say, \"she is really, really smart - she gets things faster than me.\"  And my friends and parents would be so concerned about my self-esteem when I said that.  I later had to explain to them that just because I knew I wasn't better at her at school or at music than her didn't mean I wasn't confident in myself.  A lot of people at my high school didn't see it that way.  They thought the way a lot of you guys think - they got their self-worth from being the best.  And they saw her as a threat.  They told her everyday that she was stupid and basically bullied her.  My sister to this day doesn't realize how smart she is, how she has the freaking Midas Touch all because a few self-conscious people couldn't stand the thought of not being the best.\n\nSo how do I get my confidence?  From the knowledge that everyday I am here, I get better than I was yesterday and I test *my* limits.  And my only competition is myself.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:51:45+0000", "story": null, "post_id": "462508190484900_962511903817857", "message": "#2276 Just like to say that arguments supporting #2230 are at least logically consistent, whereas I doubt everyone else that's against him is. I'm not a sociopathic asshole, I still care about people.\n\nhttps://i.warosu.org/data/lit/img/0045/99/1393213209919.png\n\nIn this instance, the train by default goes straight. Changing the track makes him responsible for the single death, and therefore a murderer. Is he responsible for the five deaths if he does nothing? If yes, then he is responsible for all deaths you could prevent but do nothing about. If not, he has no obligation to pull it.\n\nI think most here would say you should pull the lever. However, if you aren't trying to save as many lives as you can every second of every day when you have the possibility to save them, then you are in some sense responsible for all of those lives. Ignorance of how you can save someone is not an excuse, since you can always use time when you can't save someone to gather more information so that you can.\n\nI'm on the side where I think we should try to save as many people as possible. I also know that I'm not doing as much as I can to save people. Doing this burdens me with extreme guilt, because I recognize that I'm responsible for a large number of deaths. I completely understand and respect why someone wouldn't want to deal with the guilt of blood on their hands.\n\nThread for those interested:\nhttps://warosu.org/lit/thread/6026166", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:50:25+0000", "story": null, "post_id": "462508190484900_962511533817894", "message": "#2271 Can't find a good place to get mujadarah around here. Anybody know a good place to get my fix without breaking my heart, or the bank?", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:49:38+0000", "story": null, "post_id": "462508190484900_962511347151246", "message": "#2268 How is 6.005 a 12 unit class", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:49:18+0000", "story": null, "post_id": "462508190484900_962511217151259", "message": "#2266 I feel that MIT has made me less excited about learning. I'm just so stressed all the time trying to get all of my assignments finished that I have no time to actually enjoy what I'm doing or think about the wonder and the amazing implications of these topics. I feel like maybe I could learn more if I were somewhere else that actually valued me as a person and learner.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:49:03+0000", "story": null, "post_id": "462508190484900_962511177151263", "message": "#2265 Course 6 gives ~*~zero fucks~*~ about its students. Someone told me they've yet to meet a single professor that demonstrated they really cared. I certainly haven't. Maybe its because all the class sizes are so big; I dunno, but someone needs to do something about it, because this is ridiculous y'all.", "comments": 13, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:48:25+0000", "story": null, "post_id": "462508190484900_962511033817944", "message": "#2262 It finally dawned on me that I have truly found paradise in that my fellow students are fantastic friends but that everything else MIT has put me through has made me hate hate hate this fucking place", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:48:05+0000", "story": null, "post_id": "462508190484900_962510943817953", "message": "#2261 Once upon a pset, I was poring over my own graphite scrawl to find the error, which despite my endless labors had persisted somewhere between the top of page two and the middle of page five, the error, taunting, cackling at my ineptitude, scarecely able to stifle its schadenfreude, tucked away in some subscript, obscure yet plainly there, somewhere, faintly snickering, somewhere, somewhere, when abruptly and quietly nature cast a solitary ray of light, when nature, ever cruelly indifferent to misery and mirth, deigned to arrange a trifling gust to separate two tree leaves outside my window for long enough that a sunbeam could briefly alight on the errant minus sign, as if bidding me to shuffle the symbols once again, bidding me to straighten my wayward rows of curlicues, bidding me to understand the laws they so feebly stood for, those laws by which that selfsame sunbeam made its journey to this lonely earth and my meek desk, bidding me to feel and know the laws unceasingly unfolding, for just a fleeting moment.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:47:47+0000", "story": null, "post_id": "462508190484900_962510880484626", "message": "#2260 Having been here for a while, I feel as though MIT can be a pretty isolating place. Whether this manifests itself in the form of a small unchanging friend group or spending most hours alone, it seems fairly easy to fall out of touch with the MIT community at large. Maybe I'm out on a limb here, but it seems as though it's mostly through online avenues, like MIT confessions, and at the few class-wide events that some people, like me, are reminded of the fact that 4000+ other undergrads are going through the same experience, with its mix of highs and lows. A decent number of high schools where I am from used to have weekly assemblies of the student body. At the time, I took these for granted but in hindsight, it was nice and almost therapeutic to have a chance to talk to people whom I otherwise wouldn't have had an excuse to interact with. While it's college and I'm guessing people don't want to have \"assemblies\", it would be nice if there were more campus-wide events. Maybe a free food event in Lobby 10 every month open to all undergraduates? Maybe other people feel similarly and have better suggestions. I recognize that confessions is probably not the best place to propose something like this... yeah, sorry about that.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:46:42+0000", "story": null, "post_id": "462508190484900_962510537151327", "message": "#2256 The clerk at Verdes saw me putting coffee creamer into my milkshake and gave me a dirty look", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:46:17+0000", "story": null, "post_id": "462508190484900_962510427151338", "message": "#2254 I've probably met 100s of ppl here now and am still yet to meet even one who isn't amazing in some way. And yet for a place with the most amazing people I've ever met, this place does a helluva impressive job of making literally everyone feel the exact opposite way. Here's why, and this next part is going to sound rough, but I hope you read on beyond for my explanation: The fact is that I do consider some people to be more amazing than others, I mean that's only natural. That doesn't change the fact that everyone I've met here is amazing, but simply reflects the fact that we all have our own ideas of amazing. For example, the most amazing person that I know based on my standards of amazing is someone who always seems insecure/scared/inadequate for not having the best scores/stats/accomplishments but never fails to check in on a friend, which is a trait which I consider important enough to make them my most amazing. Similarly I've heard ppl consider someone who's gotten '200 top company job offers' (Clarification: That's intentional exaggeration) to be the most amazing. The point is that we are all so amazing that I guarantee that someone out there considers us to be their most amazing friend/acquaintance. Yet we are also so competitive, hell, we needed to be to get here, that we drown out that voice that considers us amazing and hear all the voices that consider us well, at worst, less amazing. Remember this quote:\n\n\"You are the most amazing person I've ever had the privilege of meeting\" -Someone, perhaps your best friend, your significant other, or someone you'll meet in the future, but I have no doubt someone has or will think this about you, and listen to them cause they're the ones who are actually right. I mean they're calling you the best person out of 7.1 billion people, which means you're pretty fucking amazing.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:45:54+0000", "story": null, "post_id": "462508190484900_962510293818018", "message": "#2253 6.01 is actually whipping my ass this semester.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:45:18+0000", "story": null, "post_id": "462508190484900_962510167151364", "message": "#2250 I seriously don't understand septum piercings. When you have a cold doesn't it get all buggery? Who would want that?", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:44:56+0000", "story": null, "post_id": "462508190484900_962510053818042", "message": "#2249 Now MIT Confessions is basically about two things: people getting horny, and political flame wars.", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:43:47+0000", "story": null, "post_id": "462508190484900_962509727151408", "message": "#2245 I really, really hate it when the midterm is not during class time. Not only do i have to spend extra time studying for it, I also have to spend extra time taking the test...", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:43:33+0000", "story": null, "post_id": "462508190484900_962509627151418", "message": "#2244 Man, rap today fucking sucks bad, I don't give a fuck what anybody says. These fools ain't spitting no type of dope shit, but that's not even the bad part; they're not even saying words anymore. They just got a hard-ass fucking beat to trick dumb asses like you to make you think you like the shit. Play that fuckin' beat. We got some real fucking mentally retarded rappers in the game. I know for a fact nobody knows what the fuck these dudes be saying!", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:42:49+0000", "story": null, "post_id": "462508190484900_962509437151437", "message": "#2241 MIT Confessions are fun.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:41:17+0000", "story": null, "post_id": "462508190484900_962509110484803", "message": "#2237 4 years and I finally got my first problem wrong. I now know what sadness feels like. Fuck this place. IHTFP.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-27T01:41:04+0000", "story": null, "post_id": "462508190484900_962509070484807", "message": "#2236 I MISSED ONE OF MY 18.01 LECTURES HOW CAN I MAKE IT UP?!?!?!?!?!", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]