[{"created_time": "2015-11-23T18:48:12+0000", "story": null, "post_id": "462508190484900_974151009320613", "message": "#2928 Gonna go home for Thanksgiving and drink until I have to come back, then drink some more", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:47:38+0000", "story": null, "post_id": "462508190484900_974150869320627", "message": "#2927 Yeah\nPset, Pset, I don't need no introduction\nPset, Pset, Ann-e Hunter on production, wow\nHundred scooters out in Random they so country, wow\nTell her pull all nighter, valet your bike, don't punt me now\nPset, Pset, live in Stata Maria I'm flexing, ooh!\n\n-for R Tran", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:47:02+0000", "story": null, "post_id": "462508190484900_974150652653982", "message": "#2924 @2888, this sounds like you.  Leaving you for good is the thing I am most proud of myself for doing. If you weren't so horrible to me I wouldn't have been strong enough to do it.  I let myself feel the horrible pain of losing you, I let myself feel it completely and didn't try to villify you to stop me from caring.  But finally, I stopped caring.  I stopped thinking about you and feeling like I would see you again.  I used to think we were soulmates, that there was no way we wouldn't die together just based on how close I felt to you.  I still remember but what I can see clearly now is all of the abuse you put me through. That was some text book emotional abuse and it wasn't OK and I will never stay with someone who does even a fraction of what you used to do.  That's why its so easy now to forget you.  After I stopped caring about you I was alone and it was beautiful.  To not have to fucking answer to anyone.  And then I met someone and I fell in love again.  Its different and so much better.  He is so much better to me than you were, he never tries to hurt me, he makes me so happy. I might marry him in the future.  Anyway, i deleted my response so many times because I didn't know where this message would end or exactly what I wanted to say. Basically I am so proud of myself for leaving you, but am grateful of everything I learned because of it.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:46:50+0000", "story": null, "post_id": "462508190484900_974150572653990", "message": "#2923 Spontaneous decisions are the best decisions", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:46:40+0000", "story": null, "post_id": "462508190484900_974150529320661", "message": "#2922 I wish Thanksgiving was a real vacation and not just a few days of tooling at your parents' house instead of the library.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:46:20+0000", "story": null, "post_id": "462508190484900_974150319320682", "message": "#2920 With a gentle caress of the inner thigh, Fabio stole my heart....and all my stuff", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:46:12+0000", "story": null, "post_id": "462508190484900_974150279320686", "message": "#2919 Like this if you think Francois should be our commencement speaker #FrancoisForCommencement2016", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:46:03+0000", "story": null, "post_id": "462508190484900_974150249320689", "message": "#2918 I just discovered that my roommate does not wash his hands after going to the bathroom. I definitely think this is something worth talking to him about. However, he also has never cleaned our room, never cleaned the bathroom (and leaves trash all over it, even though it is tiny and has a trash can), rarely showers or does laundry and thus often smells very bad, and leaves horrible smelling towels in our room and bathroom. All of these things annoy me, but since he never complains about anything I do (except sometimes opening the windows when he is particularly bad smelling), I don't want to be obnoxious or confrontational and have to talk to him about all of those things. Should I? Can I (does he have the right to not wash his hands or leave stinky towels lying around)? Do I have to pick 2? Please help.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:45:23+0000", "story": null, "post_id": "462508190484900_974150122654035", "message": "#2914 i really suck at talking to girls, but i'm really good at rationalizing ways to not even try.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:44:55+0000", "story": null, "post_id": "462508190484900_974149969320717", "message": "#2911 Most, if not all, of the grad students I know spend their weekends and general free time binge drinking. Aren't there grad students on this campus who don't need to resort to alcohol to have fun? :(", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:44:41+0000", "story": null, "post_id": "462508190484900_974149915987389", "message": "#2910 Sleep is for the weak? More like sleep for a week once this semester is finally fuckin over amirite", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-23T18:43:48+0000", "story": null, "post_id": "462508190484900_974149532654094", "message": "#2907 I keep seeing a super skinny girl around and I am just worried if she's anorexic. I don't want to offend her by asking though.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]