[{"created_time": "2015-05-12T18:39:19+0000", "story": null, "post_id": "462508190484900_880172718718443", "message": "#1751 I dream of a day where I do not have to think which elevator in the Student Center will arrive faster.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-05-12T18:38:48+0000", "story": null, "post_id": "462508190484900_880172602051788", "message": "#1749 I switched academic advisors today. When I emailed my new advisor, I made a joke about my bad GPA, because my old advisor gave me shit for getting bad grades. (\"Anon, maybe you're just not smart enough to be here.\") My old advisor didn't want to have me because I made her look bad. \n\nMy new advisor replied that he's honestly excited to get to know me better. He said he was going to work with me to figure out how to survive MIT. He didn't care that my GPA is bad. This unexpected support and acceptance made me sit down and sob for the first time in months.\n\nI didn't know why I was crying at first, but then I realized it was just the relief that someone was finally NOT judging me for my grades. Everyone who has seen my academic record just assumes things about me, because after all, how can you get D's and still deserve to be at MIT?\n\nI realized that this is the first time in two years that I've felt like more than the sum of my GPA and academic achievements. That's how I know this is such a fucked up place. Somehow, the faculty and staff have lost humanity amidst psets and exams and grades. I even forgot that I'm more than a sum of my academic achievements. It's easy to say to each other \"oh, you are more than your grades,\" but when your professors and advisor and faculty and mentors don't echo the same message, that's when things get bad.\n\nThank God for this professor. To anyone else out there who feels like they're absolute shit because their academic record isn't perfect, you are SO MUCH MORE than grades and psets and exams and school. You are a complex, beautiful, amazing human being and you deserve to be treated that way. Please don't forget it <3", "comments": 11, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-05-12T18:34:26+0000", "story": null, "post_id": "462508190484900_880170902051958", "message": "#1739 PSA: Remote controlled vibrators make classes just that much more exciting ;)", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-05-12T18:34:12+0000", "story": null, "post_id": "462508190484900_880170722051976", "message": "#1738 I'm like, \"Hey, what's up? Hello.\"", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-05-12T18:33:50+0000", "story": null, "post_id": "462508190484900_880170552051993", "message": "#1737 An orgasm a day keeps the crazy away", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-05-12T18:30:10+0000", "story": null, "post_id": "462508190484900_880169562052092", "message": "#1727 My teammates for a group project send me passive aggressive emails about how many all-nighters they are pulling and that I'm not pulling my weight.\n\nFuck off.  My mental health comes first.", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]