[{"created_time": "2015-09-30T16:00:09+0000", "story": null, "post_id": "462508190484900_951872088215172", "message": "#1884 There should be an MIT Medical Confessions page so we can talk about how Medical has screwed so many people over", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:59:57+0000", "story": null, "post_id": "462508190484900_951872021548512", "message": "#1883 When you realize the only thing more miserable than you right now is the Kresge lawn. Just. Why?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:58:54+0000", "story": null, "post_id": "462508190484900_951871554881892", "message": "#1880 I am actually for standardized testing in its current form and I have a good reason. How else are we supposed to know how the kids from various districts are doing against one another without them? Teachers have every reason to game their own grades to make their own students look good. Giving every kid the exact same test and time limit is the only way we will actually know how the kids are doing. I hear people complain, \"oh teachers will have to teach to the test, we are not teaching critical thinking\". Yes we are. Life is about passing tests, we all passed tests to get in here, you have to pass tests to get a job, that's life, kids need to get that lesson. Most people don't use, and usually don't need critical thinking anyway. The real reason teachers are against it is because they don't want to face the music and have to take the chance that they might be exposed as incompetent and get fired. Also, nobody admits this, but they could actually turn down the standardized tests legally. All they have to do is turn down federal funding. But they won't do that, they like getting 165 days of paid vacation a year, fat pensions, fat insurance plans, and for the top ones, 6 figure salaries, more then their own school freedom.", "comments": 10, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:58:38+0000", "story": null, "post_id": "462508190484900_951871468215234", "message": "#1879 Career fair is the best way to convince freshmen to major in EECS", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:58:13+0000", "story": null, "post_id": "462508190484900_951871304881917", "message": "#1877 When I got here as a freshman I had no social skills whatsoever. My parents pretty much locked me up with videos games a kid. Their reasoning was if I was around other kids they would get me hooked on drugs. Had my parents actually done any research on drug addiction they would have learned that social lives generally help people stay sober. So when I got here I couldn't hold a basic conversation with most people unless it was about schoolwork. I remember spending every night crying alone in the shower so my roommate wouldn't hear because I didn't know how to express myself or relate to him. Most people thought I was a lunatic or autistic, or some interesting combination of both. I slowly observed and learned how to do social skills with other people. My first two years here was a long painful series of poor interactions. I remember wanting to shout when people gave me odd looks, \"I'm trying to learn how to talk to you, I'm 10 years behind and I have to catch up, can you cut me some slack?!?!\" I slowly got better, made friends and even have a girlfriend now. They all actually make a point to help me be aware. So I want to let everyone else out there feeling like they can't learn to be normal with people, you can do it. It's going to hurt and be scary, but I promise with work and determination it gets better.", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:57:11+0000", "story": null, "post_id": "462508190484900_951870994881948", "message": "#1873 Everyone is getting interviews and jobs from the career fair and I didn't even get a dropbox shirt in time :(", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:56:59+0000", "story": null, "post_id": "462508190484900_951870931548621", "message": "#1872 Sometimes I see porn and think, \"wow, I wish I could enjoy being with another human being that much.\"", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-09-30T15:56:23+0000", "story": null, "post_id": "462508190484900_951870678215313", "message": "#1869 Does anyone else notice how the average attractiveness of the male population at MIT skyrockets during career fair? Smart guys in suits and classy sweaters... oh my. Now I'm not saying that if cargo shorts and plain T-shirts are your thing you need to change, but guys, if you want to turn some heads, just know that putting a little effort into your outfit goes a long way.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]