[{"created_time": "2017-01-26T07:05:00+0000", "story": null, "post_id": "462508190484900_1305562732846104", "message": "#9041 He broke up with me. I knew we were probably going to break up some day, but it still hurts. I really liked him and I really wanted for it to work out in the end. But it didn't. I keep on thinking about what I possibly could have done wrong. Is there something wrong with me? How much of it was my fault? Could it have gone differently if I had done something different? I'm trying really hard to not think about it because I know it's over, and mulling over the details of the break up just make me really sad. I wish I didn't still have feelings now. I still miss him. I miss cuddling together. I miss so many things. I just wish this would go away. I thought I was getting better, but today I think I had a relapse. I still feel really hurt. Some of the things that happened between us were so painful and at times I was very unhappy with how things were between us. So I guess it was probably for the better. But it still hurts and it fucking sucks. And he probably is doing just fine, while I'm trying really hard to just be ok.", "comments": 5, "reactions": {"like": 18, "sorry": 13}, "page_data": {"page_fans": 15497, "page_engaged_users": 763, "page_views": 712, "page_consumption": 2664}}, {"created_time": "2017-01-26T07:01:00+0000", "story": null, "post_id": "462508190484900_1305560822846295", "message": "#9033 MIT Memes for Intellectual beings is cancerous", "comments": 4, "reactions": {"like": 37, "love": 1, "wow": 1, "sorry": 2}, "page_data": {"page_fans": 15497, "page_engaged_users": 763, "page_views": 712, "page_consumption": 2664}}, {"created_time": "2017-01-26T07:00:00+0000", "story": null, "post_id": "462508190484900_1305560229513021", "message": "#9030 Whenever I see an address, I like to use divisibility rules to check if it is divisible by 9 or 11.", "comments": 4, "reactions": {"like": 39, "love": 2, "sorry": 1}, "page_data": {"page_fans": 15497, "page_engaged_users": 763, "page_views": 712, "page_consumption": 2664}}, {"created_time": "2017-01-26T06:58:00+0000", "story": null, "post_id": "462508190484900_1305559359513108", "message": "#9026 I did not have an internship before Trump took office. Now I have one. Coincidence??", "comments": 4, "reactions": {"like": 40, "haha": 3}, "page_data": {"page_fans": 15497, "page_engaged_users": 763, "page_views": 712, "page_consumption": 2664}}]