[{"created_time": "2018-09-08T14:46:37+0000", "story": null, "post_id": "462508190484900_1947992045269833", "message": "#13871 One of my TA's has such amazing handwriting that I'd like to marry it.", "comments": 4, "reactions": {"like": 4}, "page_data": {"page_fans": 24791, "page_engaged_users": 2704, "page_views": 1826, "page_consumption": 7101}}, {"created_time": "2018-09-08T14:45:52+0000", "story": null, "post_id": "462508190484900_1947991141936590", "message": "#13867 I am sure you are all very aware that someone in our group decided to make an announcement using the slang vernacular “lit\"\". This grave mistake must be addressed for the dual connotation of noobishness and disrespect.\n\nI am demanding that in the future all correspondence refrain from this weak terminology in favor of alternative synonyms. Acceptable words include: exciting, enjoyable, or illuminating.\n\nI don't mean to hurt anyone feelings by this, but the greatest authors of English literature did not toil and suffer for the likes of their entomological descendants to barrage the classic language with half baked substitutes for meaningful communication. Shakespeare suffered through a heinous divorce and multiple dead children understanding that his legacy would live on through the power of his invaluable contributions to western culture. Charles Dickens‘s father did not beat him and banish him from school so that his literature could be debased by the likes of immature school children not wanting to put forth the effort of a real sentence. Mary Shelley was not blackmailed by her enemies only to be betrayed and back-stabbed by the very individuals she devoted her life to serve.\n\nSo please, l ask of you, remember the great founders of our great culture and language in the future, when you feel so compelled to utilize such base incantations with less meaning than the sum of their letters. Indeed, instead of disgracing our ancestors without even the respect of doing it to their faces, honor them by elevating yourself to the higher standard of distinguished language.\n\nThank you", "comments": 18, "reactions": {"like": 16, "wow": 1, "haha": 19}, "page_data": {"page_fans": 24791, "page_engaged_users": 2704, "page_views": 1826, "page_consumption": 7101}}, {"created_time": "2018-09-08T14:44:37+0000", "story": null, "post_id": "462508190484900_1947989808603390", "message": "#13862 Is it normal to be attracted to a girl solely based on her attitude towards things? There is this girl I am friends with in Course 6, and her attitude towards everything seem so mature. I wish I could have an attitude like that", "comments": 3, "reactions": {"like": 9, "love": 2, "sorry": 1}, "page_data": {"page_fans": 24791, "page_engaged_users": 2704, "page_views": 1826, "page_consumption": 7101}}]