[{"created_time": "2018-05-24T04:16:00+0000", "story": null, "post_id": "462508190484900_1793878437347862", "message": "#13678 I'm 100% in favor of equality under the law regardless of gender, race, and sexual orientation but I cringe so hard at the elements of third-wave feminism which advocate for illiberal ideas like censorship (safe spaces, trigger warnings) and criminal conviction without evidence (\"always believe survivors\"). I wish more SJWs would respectfully engage with norms of democracy and human rights instead of painting any disagreement with their ideology as racist/sexist/etc; the political mainstream would take them more seriously if they did so.", "comments": 4, "reactions": {"like": 27, "love": 1}, "page_data": {"page_fans": 24364, "page_engaged_users": 1059, "page_views": 1261, "page_consumption": 3351}}, {"created_time": "2018-05-24T04:13:00+0000", "story": null, "post_id": "462508190484900_1793875927348113", "message": "#13668 \"Suspect is a black male with a black t-shirt, he reportedly has two hands and two legs\". Jee, thanks a lot!", "comments": 0, "reactions": {"haha": 2}, "page_data": {"page_fans": 24364, "page_engaged_users": 1059, "page_views": 1261, "page_consumption": 3351}}, {"created_time": "2018-05-24T04:12:00+0000", "story": null, "post_id": "462508190484900_1793875667348139", "message": "#13667 As a moderate conservative, it’s been difficult for me to understand one part of the transgender movement. I’m posting on here because I’m looking for real answers since I know that a lot of MIT students support the movement— please don’t hate on me if I come off the wrong way. I promise I don’t mean to say anything here on a degrading way :(\n\nAnyways, on with the question. I’m confused about gender identity. I understand that some people may feel as if they had been born with the wrong genitals and want to change over to the other sex. However, when someone says that they have a different gender identity but don’t necessarily feel the need or want to change their genitals. For example, if someone who is a male by sex at birth proclaims that he identifies as a female, then are they just stating that they like to partake in “female” activities such as putting on make up, liking “girlish” colors, and “speaking” like a girl? I guess what I’m asking is: do they find partaking in activities that are generally associated with female behavior fulfilling?\n\nIf this is the case, then why can’t we just consider (sorry if this is politically incorrect) “him” a male that just likes to partake in female activities? After all, if gender is a social construct, what do people have to gain by becoming “transgender (in this sense)?” Isn’t that in some ways enforcing the very gender roles that the left is trying so hard to get rid of?\n\nTLDR; I understand the feelings of those who feel as if they have been born with the wrong sexual organs at birth. But when people talk about having a different gender identity or even having a fluid gender, what does that mean? Do they just like the social aspects of a certain “gender,” even though gender is just supposed to be a social construct and gender roles in an ideal world shouldn’t exist according to the left? Please don’t hate on me :(", "comments": 3, "reactions": {"like": 17, "love": 2}, "page_data": {"page_fans": 24364, "page_engaged_users": 1059, "page_views": 1261, "page_consumption": 3351}}]