[{"created_time": "2018-04-11T15:46:00+0000", "story": null, "post_id": "462508190484900_1752101938192179", "message": "#13260 The problem with dating someone who really loves you is when you really screw up, you expect them to go off on you, but they brush it off as something trivial and you feel guilty like you deserve worse. Likewise, if they piss you off, right before you open your mouth and list all the things they screwed up on, they tell you how sorry they are and you have no idea what to do with the anger you built up.", "comments": 1, "reactions": {"like": 18, "love": 5, "haha": 6, "sorry": 1}, "page_data": {"page_fans": 24045, "page_engaged_users": 3221, "page_views": 1666, "page_consumption": 11277}}, {"created_time": "2018-04-11T15:43:00+0000", "story": null, "post_id": "462508190484900_1752099818192391", "message": "#13256 I've seen a lot of too drunk to consent stuff here. So what if two really drunk people have sex? They raped each other seems like a dumb answer. If neither of them are responsible, it seems I should get super drunk as a safe guard but that also seems dumb. I'm bad at telling how drunk people are if I don't know them well and I have a lot of one night stands. Please do not respond 'don't have one night stands' as that is a separate issue.", "comments": 5, "reactions": {"like": 9}, "page_data": {"page_fans": 24045, "page_engaged_users": 3221, "page_views": 1666, "page_consumption": 11277}}, {"created_time": "2018-04-11T15:39:00+0000", "story": null, "post_id": "462508190484900_1752096341526072", "message": "#13249 Sometimes I feel really lonely here at MIT. Classes are hard and extracurricular are stressful. I love my friends and enjoy spending time with them, but sometimes wonder how close we really are and if they really like me, or if we’re just pset buddies or friends on the surface. I feel like I know a decent number of people, but don’t know how many I’m really that close with. It’s sad to me that I’m having a hard time finding groups to hang out or go to events with, and feel slightly left out a lot. All I really want is to feel happy and included here while pursuing my goals.", "comments": 1, "reactions": {"like": 19, "sorry": 7}, "page_data": {"page_fans": 24045, "page_engaged_users": 3221, "page_views": 1666, "page_consumption": 11277}}]