[{"created_time": "2015-12-12T22:04:10+0000", "story": null, "post_id": "462508190484900_982851548450559", "message": "#3274 Red Team or Die #009mit #009red #cacaotomemory", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T22:02:53+0000", "story": null, "post_id": "462508190484900_982851068450607", "message": "#3270 Every time I send something to a Pharos printer I name it \"buttz\"", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T22:01:36+0000", "story": null, "post_id": "462508190484900_982850751783972", "message": "#3265 I was reading a teaching from a church I won't name, but it stated that if you accept Jesus and are baptized you are saved and go to heaven regardless of your sins. That makes no logical or practical sense. So I get baptized, then I can go out and commit a ton of horrendous crimes and then it doesn't matter I'm good? lol I'm not religious, but how on earth do those clueless fools think they can get any converts with that message. You have to sell the message of you need us, not you're good regardless.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T22:01:01+0000", "story": null, "post_id": "462508190484900_982850625117318", "message": "#3263 How in the world would a naked run relieve stress? Having everyone see me naked and risking possibly having to register as a sex offender seems more stressful to me than any final exam could ever be.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T22:00:31+0000", "story": null, "post_id": "462508190484900_982850395117341", "message": "#3261 Tourists should be banned from MIT during finals.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T22:00:01+0000", "story": null, "post_id": "462508190484900_982850171784030", "message": "#3259 I faked half of my orgasms with you during our relationship, but then I learned you faked half of our relationship so I guess I lose on both counts.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T21:59:52+0000", "story": null, "post_id": "462508190484900_982850118450702", "message": "#3258 I piss on the walls of the Baker elevator when I'm bored.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T21:59:41+0000", "story": null, "post_id": "462508190484900_982849845117396", "message": "#3257 Being gay automatically put you in the friend zone of 90% of guys. :(", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-12-12T21:59:30+0000", "story": null, "post_id": "462508190484900_982849791784068", "message": "#3256 I just got facialed. I just got fucking facialed. Can you believe it? I'm his girlfriend, his better half, his significant other, his soon to be within a matter of 365 days his wife. And he facialed me. He fucking facialed me.! Ladies chivalry is motherfucking dead I tell you! Dead! It has to be dead when youre fiancé in the heat of reaching the climate of his sexual excitement decides to deposit the evidence of that heightend sexual excitement on your face. Wtf? No motherfucking respect none. He didn't even ask me if he could facial me. That what bugs me. He didn't straight up and ask could he start cinco de mayo early on my face, he decided to cum(pun intended) without any formal invitation. And why my face? Why my motherfucking freckle free face? He could have cum any where else? My tit, my stomach, my arm, hell even my hair. But no. he had to fucking cum on my face. Ladies I don't think I need to tell you that the face of a lady is the window to the soul, the key to her inner workings, the mechanics of her deign. A woman's face is her temple. It is also her weapon. A woman's face Is a weapon. A weapon whose greates attribute is that it conceal. O how it can conceal. Heartbreak, disappointment, anger, resentment. Yes our faces hide all behind a smile. That's what I gave him a smile. As I was I situated on my knees, face covered in his baby gravy. I gave him a smile. Why. To rlay a message. To relay him a message. Everything is allright. Eveyrthing is ok. The fact that you just deposited your stinky load on me is inconsequential. Two minutes later as he feasted on my mossy bank I moaned. O how I moaned. Not because he is a skilled pussy eater. Oh no. He cant eat pussy worth shit. He can throw down in the bedroom but eating pussy is not his specialty. But still I moaned. I moaned for my revenge is perfect. Tomorrow I start my period. Tomorrow according to the calendar is when the parting of the red seas begin. And I'm gonna make damn sure he's in the same position he's in now. Ironically he hates twilight. You and Edward are about to have something in common.", "comments": 8, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]