[
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637816512954056",
    "message": "#10947 I have more stress about my crypto investments than I did during the semester :(",
    "comments": 17,
    "reactions": {
      "like": 23,
      "haha": 3
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637811849621189",
    "message": "#10918 Does anyone know if Junot Diaz is teaching a class in the spring?",
    "comments": 2,
    "reactions": {
      "like": 5,
      "love": 1,
      "wow": 1
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637815366287504",
    "message": "#10938 tbh, every time I see the rabbits around campus I start craving rabbit stew",
    "comments": 29,
    "reactions": {
      "like": 64,
      "love": 4,
      "wow": 5,
      "haha": 22,
      "sorry": 18,
      "anger": 10
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637817169620657",
    "message": "#10951 @10896 Many people use \"male\" and \"female\" to talk about sex (ie \"Do you produce sperm or eggs?\") and \"man\" and \"woman\" to talk about gender (ie \"How do you identify and what is your role in society?\"). Not all conversations are okay with genitalia mentions (penis-haver/vagina-haver may be inappropriate), and this isn't always talking about assignments at birth (so AFAB/AMAB don't fit).",
    "comments": 1,
    "reactions": {
      "like": 2,
      "haha": 1
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637816769620697",
    "message": "#10948 My fraternity brothers and I were really bored at 2 AM, so we decided to look up everyone's names on Urban Dictionary. I have a pretty unusual name so I wasn't expecting anything, but to my surprise there was a pretty detailed \"definition\" with compliments relevant to me. On top of that, it had been posted on my birthday.\n\nUrban Dictionary user \"Stinky Stan\", I don't know who you are but you're a real bro.",
    "comments": 2,
    "reactions": {
      "like": 11,
      "love": 1
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637811546287886",
    "message": "#10914 I met a girl who brought genuine joy to my life, something I have been missing for a miserably long time. This may just be me being abnormal, but I never say too much out of fear that people might think I am being weird or stupid and it feels like I am just bottling this unbearable depression. Never knowing if I am saying the right things or if I am really included in the group. This girl though, I just felt comfortable with. I felt like I could say what I wanted to say and I could trust her not judge me and accept me for the weirdo I am. We started talking more and more frequently and each time we talked I enjoyed myself a little more. I started liking her, but I guess I caught the feels too quick and the feeling wasnt mutual. I found out later that she apparently already liked someone else and the more I think about it the more laughable i think it was for me to think I had a chance. But I still like her and I don't know what to do with these bent up feelings. I just want to tell her how much she means to me, but who wants a person, whom they already told they dont like them, confessing to them out of nowhere. I can only hope to catch a glimpse of her in the halls on the way to classes now. I want to get over her, but I cant.",
    "comments": 0,
    "reactions": {
      "like": 10,
      "sorry": 11
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637815722954135",
    "message": "#10942 Finally did my laundry.",
    "comments": 29,
    "reactions": {
      "like": 104,
      "love": 12,
      "wow": 2,
      "haha": 12,
      "sorry": 1,
      "anger": 2
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637818539620520",
    "message": "#10958 L=Iw",
    "comments": 7,
    "reactions": {
      "like": 16,
      "wow": 1,
      "haha": 2,
      "sorry": 1,
      "anger": 5
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637813969620977",
    "message": "#10928 This last semester was my best semester at MIT, and I don't hesitate to tell family that when they ask how the semester was. My semester GPA was a 3.5, though, and I can't help but feel like a fucking moron. All the time and effort spent, mental and sometimes physical suffering, and I have a fucking 3.5 semester GPA to show for it, with a lower cumulative GPA to boot...",
    "comments": 3,
    "reactions": {
      "like": 25,
      "love": 6
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637818126287228",
    "message": "#10956 tl;dr: i'm a relatively affluent person and boy oh boy does money = privilege, this is something i try to be constantly aware of because it has made such a huge difference in my life\n\nI wanted to throw my two cents into the discussion about wealth and privilege, so here goes. My family is relatively affluent, and we live in a pretty well-off town. Both my parents grew up poor, so they've worked to make me aware of how much of a difference money can make. In some sense I've always been aware of this privilege - that I've grown up not having to worry about food and medical treatment and etc. I knew that even when family members were dealing with alcoholism and cancer and depression, we could afford to get them the help they needed. Even though it was awful to see people you love struggle with these problems, it felt like something was being done to help. So I've known that my family and I are extremely lucky to have the access to what we need.\nBut I wasn't really confronted with this until I came here. I was surrounded by people who were all roughly in the same income bracket as me for most of my pre-college life. After coming to MIT, I think I fully realized that class privilege isn't about the conspicuous consumerism or using the money you have at all. It's all the other things that come as a consequence of just having money - the security in times of trouble and access to resources because you're in the right places.\nBecause the town I lived in is pretty well-off, we had a really solid public school system - my family never felt the need to pay for private schools or tutoring, because between my own initiative and the support I had in these schools, I got a pretty solid education. I was able to take advanced classes and do research and intern at a company before coming here just by virtue of being in that town and meeting people there. I ASE'd a bunch of subjects because I had had the chance to take higher level math and science classes in high school, which is an opportunity other people just didn't have. Even if I didn't bribe my way into those classes and worked hard to test into them, the reason they were there at all is because my school was funded by the taxes that people in my town pay. I didn't have to pay a dime once I was in the school system, but just by being able to afford to live in that town I got a leg up on people who couldn't and thus ended up in worse schools. I've met people here who didn't have a fraction of the access to education that I did, and it really made me step back and think about the tremendous privilege that I have and how much easier it was for me to get here. That's not to say it was easy at all - but it definitely was easier.\n\nMIT really made me realize that class privilege is not as much about the money itself as it is about the access and support that just having money immediately gets you. Nobody is saying that because you're wealthy your life is rainbows and sunshine (although it might be, and in that case I'm really happy for you). Your problems aren't less valid that anyone else's. It's just also important for you to realize that other people have problems you just have never had to deal with and cannot probably begin to comprehend. And you've had access to things and support that other people haven't had even though they probably really could have used it, and that's huge. Just think about it a little bit.",
    "comments": 3,
    "reactions": {
      "like": 180,
      "love": 25
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  },
  {
    "created_time": "2017-12-23T14:00:00+0000",
    "story": null,
    "post_id": "462508190484900_1637812656287775",
    "message": "#10921 I'd go gay for Reif.",
    "comments": 1,
    "reactions": {
      "like": 14,
      "love": 5,
      "wow": 6,
      "haha": 1
    },
    "page_data": {
      "page_fans": 18878,
      "page_engaged_users": 5755,
      "page_views": 6734,
      "page_consumption": 27159
    }
  }
]