[{"created_time": "2015-11-20T21:55:43+0000", "story": null, "post_id": "462508190484900_972928529442861", "message": "#2882 I just want to acknowledge the students at MIT who take time out of their buys, stressful MIT schedules to volunteer and try to raise money though the UGC. It takes balls to put your face out there and ask fellow students for their financial support. As a former tech caller, calling alumni over the phone for pay to ask for donations was one thing, but asking people that you recognize in person for no pay is another. Bravo.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:51:10+0000", "story": null, "post_id": "462508190484900_972927349442979", "message": "#2874 I feel like everything in my life is subpar. I enjoy all of it but there's nothing that I would not replace with something better. I really like my freinds but there are better ones, I like my girlfreind but I could find one prettier and more fun. I am excited about my job that I will be pursuing but it isn't my dream job. \n\nWhen I was younger, I thought I would always work and get want I wanted but now I feel as though life is just about settling for the best you can get.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:50:38+0000", "story": null, "post_id": "462508190484900_972927216109659", "message": "#2871 What happens when you know MIT is actually nothing different from any other place in the world.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:48:24+0000", "story": null, "post_id": "462508190484900_972926769443037", "message": "#2867 tbh I really dislike 'I'll make a man out of you' because (1) I fucking swear I've had to listen to this song every week for the past like 8 years and (2) although I know Mulan's all about girl power, the song is obviously sexist.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:47:40+0000", "story": null, "post_id": "462508190484900_972926589443055", "message": "#2864 I'm a UGC volunteer, and it's personally hard for me to speak to you all in the infinite. I believe in the philanthropy, but all the complaints and the determined ignorance of our presence in Lobby 10 is disheartening. If we're in the way, if you don't want to or aren't able to give, if you don't believe in helping out fellow student projects because you think MIT is somehow hoarding more money than your tuition, that's fine. I just wanted to say that at the beginning of my shifts I'm anxious because I know I'm stopping you on your way to class, and I know most of you are going to ignore me, but I think it's worth noting that a \"no thanks\" is a thousand times more humane than denying us the acknowledgement of being your colleagues.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:47:12+0000", "story": null, "post_id": "462508190484900_972926459443068", "message": "#2862 It sucks to realize that I missed an opportunity, especially when I'm not sure what changed. I guess he just got a better sense of who I was, but I should have fucked him when I had the chance.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:46:27+0000", "story": null, "post_id": "462508190484900_972926289443085", "message": "#2858 The constant jokes about how annoying and invasive the UGC people are is so depressing. They're raising money for a good cause, and they try to get your attention so they can do a better job of that. And if you really can't afford to donate, of course that's understandable, but I seriously doubt that's the case for everyone bitching about it. It wouldn't kill you to stop for a minute and donate a dollar.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-20T21:46:11+0000", "story": null, "post_id": "462508190484900_972926236109757", "message": "#2857 Ever since I left the city you got a reputation for yourself. Now everybody knows, and I feel left out. Girl you got me down, you got me stressed out. Because ever since I left the city, you started wearing less and going out more. Glasses of champagne out on the dance floor, hanging with some girls I've never seen before. You used to call me on my cell phone.\n\nLate at night when you need my love, call me on my cellphone.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]