[{"created_time": "2015-10-29T18:14:46+0000", "story": null, "post_id": "462508190484900_963654077036973", "message": "#2370 I have been looking forward to Boo's cruise since I was a freshman. Now I have a ticket and tomorrow will proceed to get the most shitfaced I have ever been in my entire life. #startedfromthebottom #nowwedrunk", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:13:27+0000", "story": null, "post_id": "462508190484900_963653713703676", "message": "#2368 I was masturbating thinking about a past fuck buddy, and I accidentally moaned my current bf's name. High five subconscious me.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:13:06+0000", "story": null, "post_id": "462508190484900_963653620370352", "message": "#2366 There are two seasons at MIT: Winter and gigantic white tents keeping the grass nice and dead on the Kresge lawn.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:12:55+0000", "story": null, "post_id": "462508190484900_963653567037024", "message": "#2365 My professors just moved back the deadline for the pset by a few days and I actually cried a little when I saw the Piazza post.  I get to sleep between now and the due date.  The worst part is, part of me wishes they hadn't so I could have a good reason to spend the next two days deep in a haze of stress and work.  I feel so goddamn alive when my bones are vibrating with caffeine and it seems like all that's standing between me and believing I'm good enough to be here is this one pset or test.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:10:09+0000", "story": null, "post_id": "462508190484900_963649993704048", "message": "#2353 I tell all my friends that I'm thirsty af but all I really want is some post-coitus consensual cuddling for the sole purpose of coziness.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:09:55+0000", "story": null, "post_id": "462508190484900_963649923704055", "message": "#2352 I used to help out at my old high school district board meetings for credit, and it brought up something interesting regarding school discipline. A lot of people are rightly worried about police officers in school with children. The reason so many schools do it is that lawsuit threats make it very difficult for them to enforce discipline. Any wrong gesture or accidental mark left while physically dragging a disruptive student away could lead to criminal charges for the teacher and the school. Police officers are trained how to do this properly, have experience, and can do it with minimal legal threat. If you really want to get police officers out of schools support tort reform so teachers can safely grab students who are fighting or being wildly disruptive in class.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:09:30+0000", "story": null, "post_id": "462508190484900_963649807037400", "message": "#2350 my vagina has started smelling like oatmeal and idk why", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:09:19+0000", "story": null, "post_id": "462508190484900_963649753704072", "message": "#2349 Every time the professor says \"slab\" in 2.005 lecture I think of the ghost of Ramses showing up in lecture and asking him to return the slab.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:08:55+0000", "story": null, "post_id": "462508190484900_963649627037418", "message": "#2347 I'm always falling asleep in classes and when I'm working on psets, but I can't fall asleep when I actually want to sleep.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:07:54+0000", "story": null, "post_id": "462508190484900_963649360370778", "message": "#2343 After being at MiT for a couple of years I've had a lot experiences that have redefined my self-identity as an academic and a person. We've all struggled here-okay *most* of us for one reason or another. We've all questioned ourselves and the Institute for what it *claims* to offer.\n\nFor me personally, I've constantly struggled here. My freshman year I chalked it up to not having a strong technical background. I didn't take AP Chem or higher level biology and those were the classes I got my fifth week flags in. As I was getting adjusted to just how rigorous (read: how absolutely fucking ridiculous) MiT work can be, sophomore year came. Once again I was flogged by work. Now in my major I chalked up to never seeing the material before, but sophomore year I realized, just like most people realize sophomore year, that something is up. MIT\nmay be ranked one of the greatest schools in the world but you wouldn't be able to tell that by the quality of the teaching. \n\nSee, every homework assignment I've EVER gotten at MiT. I've had to google, I had to Wikipedia, I had to Internet. Every assignment required me to learn what ought to have been taught in class. The problems were never really elucidated by lecture. They just show where the hole is, and the homework throws you in. \nAfter a few years here I've gotten tired of it. When I see professors say \"you'll learn through the Pset\" I realize that's often a poor guise to cover their poor teaching. And as much as people may learn from really hard problems only loosely connected to the lecture, I don't. Relying on excessively hard problems to most of the value to your education is one size fits all solutions that fails to take into account people's differing learning styles or the fulfillment of the undergraduate experience. I learn from teachers. Not problems. Even if I did, with the constant rush to the next assignment or the next problem you don't have the time to dissect a problem for its moral of the story. Let's be honest, you  don't even have time to sleep here. \n\nNow say what you will about MiT needing to be \"rigorous\" or hard, but in reality, I've spent years here just googling. Now googling Isn't inherently a bad thing , but when I find other universities with far better notes and lectures than MiT-constantly-I have my doubts about the Institute. \nI have my doubts when I see all of us struggling to get by, when I see suicide after suicide, and realize we are some of the smartest people in the world. Yet, collectively we struggle here. Yes, we came here for a challenge and yes struggling is a great way to grow, but clearly the struggle here is an order of magnitude off.\n\nGreat researchers don't always make for great teachers. And yes, the idea of having the best in the world teach you sounds great...but I realize being taught by the best *teachers* in the world would be a helluva lot better.\n\nI'm just writing this because I feel others can relate and this sentiment should be voiced\n\n~Holla", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:07:05+0000", "story": null, "post_id": "462508190484900_963649130370801", "message": "#2341 I don't understand people who keep saying that they hate MIT and still stay here. Why don't you transfer to a better school where you will feel comfortable and where you think you will feel welcomed? If you are staying, that means there is something about this school that makes you want to stay. So STOP COMPLAINING.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:06:37+0000", "story": null, "post_id": "462508190484900_963648987037482", "message": "#2340 I am honestly scared of the sandman coming into my room and pouring sand down my throat.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:05:44+0000", "story": null, "post_id": "462508190484900_963648690370845", "message": "#2336 Serious question about CatDog: Does Cat fart, or is it really just Dog burping?", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-29T18:05:24+0000", "story": null, "post_id": "462508190484900_963648587037522", "message": "#2334 I wish my fuck buddy was less busy. I'm down for nearly every night.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]