[{"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632136480188726", "message": "#10699 i need to be friends with guys who have less sex than me so i feel better about myself", "comments": 13, "reactions": {"like": 7, "haha": 7}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632134563522251", "message": "#10687 I'm the high school student who confessed here many moons ago in Confession #5980 (that was sophomore or freshman year, I think). \n\nI'm a HS senior now, heading into finals and about to submit my MIT app. Got my scores back and have already reported them. \n\nJust wanted to thank the commenters from that post for saying what they said about applying and stuff. It really gave me the gumption and backbone to just do what I wanted with my ECs and not be too highstrung with the profiles and stats and all that. My essays are pretty honest and from the heart. All that's left is to press the submit button and let the folks in admissions handle the rest. \n\nEven if I get rejected, it'll be fine. I did and studied what I liked in high school and am happy that I tried for a great school like MIT.", "comments": 3, "reactions": {"like": 69, "wow": 2}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632136633522044", "message": "#10700 Neil Aggarwal is so talented what a singer what a performer WHAT A GUY", "comments": 4, "reactions": {"like": 37, "love": 5, "wow": 2, "sorry": 1}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632130833522624", "message": "#10667 I am a TA and it makes me sad when students in the class come and tell me they learned more from me than the professor. Of course I appreciate their kind words, but that’s not the way things are supposed to be. \n\nMIT spend all this effort focusing on research and ignoring teaching quality. I only fell in love with the subject I am TAing because I had an amazing professor. The fact that the school kills students’ interest in subjects with bad professors is depressing. One of the saddest things in life is wasted talent.", "comments": 10, "reactions": {"like": 163, "love": 8, "sorry": 34}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632133036855737", "message": "#10679 please. indoor voices in the libraries. especially in the lead up to finals. because who knows what angery sleep deprived students might do when...provoked...", "comments": 6, "reactions": {"like": 15}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632134093522298", "message": "#10684 Everytime my boyfriend ditches me for his friends. I want to tell him to wake up. I'm not gonna be here forever. It's hard swallowing my pride and trusting he will figure it out on his own. So much precious time is passing us by. I mean, you say you rather be with me, more than anyone in the world. That I put your soul at ease. But as soon as they call, you leave to go smoke weed and eat. Tell me what should I believe? But I love you anyway.", "comments": 2, "reactions": {"like": 11, "haha": 1, "sorry": 12}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}, {"created_time": "2017-12-17T06:15:00+0000", "story": null, "post_id": "462508190484900_1632135746855466", "message": "#10696 I am a new Research Intern at MIT. What do I do to meet new people, socialize, and make friends? Sports clubs, classes, or something else?", "comments": 9, "reactions": {"like": 3}, "page_data": {"page_fans": 18763, "page_engaged_users": 5260, "page_views": 6939, "page_consumption": 25774}}]