[{"created_time": "2015-11-03T04:41:44+0000", "story": null, "post_id": "462508190484900_965436723525375", "message": "#2443 I wouldn't really mind if someone broke up with me. Because that would mean that there existed someone who liked me in the first place.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:41:22+0000", "story": null, "post_id": "462508190484900_965436640192050", "message": "#2441 To Next House Kitchen: If you can't even cook rice right, what can you do in life?", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:41:09+0000", "story": null, "post_id": "462508190484900_965436586858722", "message": "#2440 I think I might be the worst MIT student ever to make it to senior year. I've never had a job, internship, externship, or UROP. I'm not in any clubs. I haven't done well, nor am I currently doing well, in many of my classes. My advisor probably thinks I'm a piece of shit. I think I'm a piece of shit. I think I’m a dumb, ugly, unmotivated, boring, socially awkward dysfunctional piece of shit. That’s what goes through my head, constantly.\n\nI have issues... my biggest one is that I'm AFRAID of people. Paralyzingly afraid of people. Always worried about what people think of me, always fearing I’m being watched and judged in public. I have a huge social anxiety problem. And it's cause I hate myself and have no confidence. It’s probably why I never reach out to people for new friends or jobs.\n\nI’m tired of spending entire weekends in my room, only going out for bathroom breaks and to get dinner in a green box. I’m tired of spending hours on a pset failing to make any real progress. I’m tired of struggling in office hours, hearing people say they get it and it all makes sense now when I’m still confused, probably on a problem before the one they just got. I’m tired of not being able to get help when I feel this way because I can’t talk properly to whoever comes to help me, in excruciating discomfort and fear that they and whoever else is overhearing will probably think I’m a dumbass.\n\nI’ll never deliberately kill myself. I’m too scared of the possibility of hell, and I don’t want to put my family through the grief. But I feel trapped in my inhibitions. I have to change something. But I’m not going to S^3 or mental health to do it, cause that’s more people, and they’ll probably just kick me out. Sorry to add another sad confession on here.", "comments": 10, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:40:18+0000", "story": null, "post_id": "462508190484900_965436433525404", "message": "#2437 I have a suspicion that Spotify make their ads subtly torture your ears so that you'll get the premium version just to escape.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:40:07+0000", "story": null, "post_id": "462508190484900_965436376858743", "message": "#2436 I feel bad for Prof. Entala Nako and Prof. Bob Weinberg. Just because she's not an epic professor like Lander, nobody claps for them when 7.012 lecture is over. Meanwhile, Lander gets all the appreciation. Nako and Weinberg are working hard too and they try their best to teach you the material while keeping you engaged. Give them a little happiness by being grateful -- maybe they'll do better as they get more positivity from us, the students.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:39:40+0000", "story": null, "post_id": "462508190484900_965436240192090", "message": "#2434 I \nLike\nBig \nPsets and I cannot lie!\n\njk i wanna go to sleep", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:39:29+0000", "story": null, "post_id": "462508190484900_965436210192093", "message": "#2433 Sometimes I stay up late even when I promised to go to sleep because I am so excited by the work I am doing. #IHTFP\n\n(Disclaimer: Yeah, sometimes it sucks, it really, really, painfully sucks, but sometimes life is good, too, and sometimes I am really overjoyed that I came here. I wanted to share more positivity on this page.)", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:38:39+0000", "story": null, "post_id": "462508190484900_965436040192110", "message": "#2429 what to do when you \"know\" someone and they \"know\" you but neither of you know each other enough to acknowledge knowing each other... #sociallyawkward", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:38:11+0000", "story": null, "post_id": "462508190484900_965435916858789", "message": "#2426 It's Nov. 1 - frosh, feel free to make out with me now.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-03T04:37:05+0000", "story": null, "post_id": "462508190484900_965435706858810", "message": "#2419 I speak more Spanish than English at MIT.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]