[
  {
    "created_time": "2015-11-07T20:54:59+0000",
    "story": null,
    "post_id": "462508190484900_967437046658676",
    "message": "#2529 Begins rant:\n\nAs a black non-American male who can actually dance, [as confirmed by my awards from dancing competitions] lets say I am actually frustrated by the type of girls I meet on the dance floor at MIT and around the Boston area. (Am 21+) . In my experience, I have met two types of girls.\n\n1) The white, asian [including Indians of course], or black girl who is insecure or probably lacks exposure and refuses to dance with any black male. I make this conclusion because I see them dancing with another  non-black male immediately after they turn down dancing with me. And repeat this disgusting behaviour throughout the party. I actually try to watch to see if I can prove myself wrong. Unfortunately, they prove me right every fucking time.\n\n2)  The ones who understand that a party is just a party and are willing to dance with anyone who can prove that they got moves.\n\nNow, if you belong to group two, clap for yourself. Those who belong to group one however, should check themselves or their prejudices. Do you prefer dancing with non-black males to black males? Why?...\nDo you understand that this behaviour could have a racist undertone? If you act this way because of what the media perpetuates, check yourself. Relax and have fun. Parties are supposed to be fun and not a space to bring whatever racist tendencies you have. \n\nThis post about discrimination also rings true for black women and online dating as well... but I won't delve into that for sake of brevity.\n\nI feel like this part of the world is overly obsessed with unfounded assumptions about races to the point where communities at schools like MIT and other schools around the Boston area are so segmented. Lets chill and have fun people, We share more in common than our differences to be honest...\n\n***ends rant",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:54:31+0000",
    "story": null,
    "post_id": "462508190484900_967436943325353",
    "message": "#2528 As a man involved in the feminist movement I want to call out some hypocrisies I have personally witnessed. Certain feminists want equal rights but also want men to be expected to hold the door for them and pay for them on dates. That is not equality. If you really want equality then you don't get doors held for you by men for being a woman or meals paid for, you can't have it both ways.",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:53:34+0000",
    "story": null,
    "post_id": "462508190484900_967436713325376",
    "message": "#2525 The privileging of solid over fluid mechanics, and indeed the inability of science to deal with turbulent flow at all, she attributes to the association of fluidity with femininity. Whereas men have sex organs that protrude and become rigid, women have openings that leak menstrual blood and vaginal fluids... From this perspective it is no wonder that science has not been able to arrive at a successful model for turbulence. The problem of turbulent flow cannot be solved because the conceptions of fluids (and of women) have been formulated so as necessarily to leave unarticulated remainders.",
    "comments": 5,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:53:16+0000",
    "story": null,
    "post_id": "462508190484900_967436633325384",
    "message": "#2524 How come we don't have a Sex Week like Harvard's? Sounds super fun and informative",
    "comments": 7,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:53:03+0000",
    "story": null,
    "post_id": "462508190484900_967436536658727",
    "message": "#2523 If MIT is this billionaire institution that helped creating the Internet, then how the heck is the connection at Senior Haus so shitty?",
    "comments": 5,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:52:40+0000",
    "story": null,
    "post_id": "462508190484900_967436419992072",
    "message": "#2521 Sometimes I think people walking behind me are talking about me. I don't know if I have issues or just super unlikable.\n\nThen I internally debate whether I should even care about if they are talking about me or if I should take their potentially non-existant criticism and grow into a better person. But mostly I just feel bad.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:52:11+0000",
    "story": null,
    "post_id": "462508190484900_967436246658756",
    "message": "#2519 This weather is just as confused as us students",
    "comments": 0,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:52:01+0000",
    "story": null,
    "post_id": "462508190484900_967436209992093",
    "message": "#2518 Can we talk about how a woman died in the sauna in DuPont and all we got was a tech article about it??? None of my friends knew until I showed them the article...",
    "comments": 9,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:50:30+0000",
    "story": null,
    "post_id": "462508190484900_967435873325460",
    "message": "#2513 I can't believe all my friends are obsessed with a show about gay space rocks.",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:50:21+0000",
    "story": null,
    "post_id": "462508190484900_967435839992130",
    "message": "#2512 Squadliness is next to godliness",
    "comments": 0,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:49:13+0000",
    "story": null,
    "post_id": "462508190484900_967435566658824",
    "message": "#2507 All I want is for MIT to offer Culinary Sciences as a HASS-A",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:48:49+0000",
    "story": null,
    "post_id": "462508190484900_967435463325501",
    "message": "#2505 I treat my psets like I treat my girlfriends, ignore them and let them disappear.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:47:23+0000",
    "story": null,
    "post_id": "462508190484900_967435149992199",
    "message": "#2499 My dream threesome is me and the Dalai Lama double teaming T-Swift on Kresge.",
    "comments": 0,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:47:03+0000",
    "story": null,
    "post_id": "462508190484900_967435049992209",
    "message": "#2497 I still battle with the fact that flexibility is not your ability to flex.",
    "comments": 2,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:45:59+0000",
    "story": null,
    "post_id": "462508190484900_967434799992234",
    "message": "#2494 I was working on a pset for chem the other day and after I was done, I was quite bored, so I jizzed on it and let it dry before submitting it. Hope prof. thinks it just fell in a puddle or something.",
    "comments": 2,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:45:47+0000",
    "story": null,
    "post_id": "462508190484900_967434713325576",
    "message": "#2493 I've had many bad friendships, and I'm trying to start over but I've lost all hope I had in me and other people. I can't make friends anymore, and all the time spent alone (amongst other things) is giving me suicidal thoughts. I made some changes, and I had such high hopes that everything would work out this year but it all came crashing down. For the first time in 3 years, I cant muster up any hope for the future. What do I do now?",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:44:02+0000",
    "story": null,
    "post_id": "462508190484900_967434123325635",
    "message": "#2486 What is with people loudly talking during lecture? I understand if you have a question about what the professor wrote on the board, just whisper or wait until the end of class. But why do some people insist on loudly talking about non-class related things during class?! Not only are you distracting the other students in the class, you're being extremely rude to the professor. I pay a lot of money to sit in this class, it'd be awesome if you would shut the fuck up so I can hear what's going on. And if I ask you nicely to be quiet don't give me attitude back. People these day smh.",
    "comments": 0,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:41:52+0000",
    "story": null,
    "post_id": "462508190484900_967433506659030",
    "message": "#2476 i would let donald trump creampie me if that meant i didn't have to take this bioinformatics exam.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:41:28+0000",
    "story": null,
    "post_id": "462508190484900_967433369992377",
    "message": "#2474 I sunk down on my knees and clasped my hands together, praying to a God I don't believe in. \"Just give me a D--all I need is a D. Just a D.\" The double entendre suddenly crosses my mind. My embarrassment is apparent, and my professor is young enough to understand the unintentional sexual innuendo of my pleas. Fucking stupid awkward whore that I am. fuck.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:40:58+0000",
    "story": null,
    "post_id": "462508190484900_967433266659054",
    "message": "#2472 It feels like every time I eat at Maseeh, I see about half of the tables occupied by people eating alone. Can't we all just learn to sit together at meals, regardless of whether we even know each other?",
    "comments": 6,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-11-07T20:40:47+0000",
    "story": null,
    "post_id": "462508190484900_967433209992393",
    "message": "#2471 I came to MIT expecting my classmates to be fucking smart. I am now a junior and realize that I was totally wrong. Most MIT students aren't much smarter than average, they just work hard.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  }
]