[{"created_time": "2015-10-21T16:21:41+0000", "story": null, "post_id": "462508190484900_960302380705476", "message": "#2100 Oh baby, do me like one of your PSETs. Long and hard and all night long, and then crying because you didn't finish.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:21:25+0000", "story": null, "post_id": "462508190484900_960302307372150", "message": "#2099 For me, it stands for \"I Have Tampons For Periods\"", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:21:04+0000", "story": null, "post_id": "462508190484900_960302097372171", "message": "#2098 I am a senior with no clue as to why some emails contain \"*insert color* for bc-talk\" and at this point I am too afraid to ask.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:20:45+0000", "story": null, "post_id": "462508190484900_960301927372188", "message": "#2096 I want to take a moment to defend Sanders from some of the haters here. They keep asking, how can we pay for the all the infrastructure spending without raising middle class taxes? Fair question, it doesn't mean Sanders hasn't thought it through. It's simple, we borrow more money. The U.S government is not a business, we have no borrowing limits. And the best part is, since we are the superpower of the world, we can borrow from other nations non stop and if we can't make the payments, we just tell them to take a hike and default. They can't come seize our assets or do anything, they just have to take a loss. That's their problem, not ours. Then we just borrow more at a higher interest rate and more to pay the higher interest, wash, rinse, repeat.", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:20:26+0000", "story": null, "post_id": "462508190484900_960301797372201", "message": "#2094 I ended up as an odd third wheel in an Obamacare debate the other day. One guy said we should repeal it, the other said it's fine. What neither said pointed out was that both their ideas suck. What I think we ought to do as a nation is address the fundamental causes of sky high health care prices which no plan addresses. For example, you cannot import drugs from other countries. You can get them so cheaply elsewhere, but it's illegal to get them here. Another problem is buying insurance. You can't buy across state lines. So each state insurer gets their own monopoly and doesn't have to compete. Democrats say the old system was capitalism out of control, Republicans say the new system is socialism out of control. It's crony-ism out of control. If we address these fundamental flaws, insurance will be irrelevant.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:20:04+0000", "story": null, "post_id": "462508190484900_960301597372221", "message": "#2092 In desperate need of a Time Turner. Hermione, could I borrow yours?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:19:47+0000", "story": null, "post_id": "462508190484900_960301464038901", "message": "#2090 I have immense respect for the ROTC kids here.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:19:22+0000", "story": null, "post_id": "462508190484900_960300870705627", "message": "#2088 I feel like everyone around me is having (a lot of) sex but me....", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:19:12+0000", "story": null, "post_id": "462508190484900_960300327372348", "message": "#2087 I have the biggest crush on this course 2 sophomore in my 18.03 class.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:18:59+0000", "story": null, "post_id": "462508190484900_960300104039037", "message": "#2086 Stuck in limbo with how I feel about this girl. I had a class with her last year and I can't tell if I just think she's hot or if I like her more than that. She's a year older than me and we are somewhat friends and I'm so confused as to what to do.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:18:39+0000", "story": null, "post_id": "462508190484900_960299940705720", "message": "#2084 I have to confess that it pisses me off when a high school parent emails me, asking me how his son should answer \"Why are you interested in MIT?\" question. I can't tell you why your son is interested! smh", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:17:50+0000", "story": null, "post_id": "462508190484900_960299657372415", "message": "#2080 Sometimes I cry over emotional Facebook videos.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:17:38+0000", "story": null, "post_id": "462508190484900_960299547372426", "message": "#2079 I get high on caffeine and trap music.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:17:09+0000", "story": null, "post_id": "462508190484900_960299327372448", "message": "#2077 Has anyone really been far even as decided to use even go want to do look more like?", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:16:48+0000", "story": null, "post_id": "462508190484900_960299234039124", "message": "#2075 i'm afraid of canadian people", "comments": 16, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:16:22+0000", "story": null, "post_id": "462508190484900_960299117372469", "message": "#2073 I thought I was a happy and optimistic person, but during the past few weeks I've been rejected by many companies, bombed several tests, and gotten ignored by people. I feel like nothing good has happened to me lately. I'm really scared that if my bad luck continues, I'll end up doing something I regret, like self-harm or worse.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-21T16:15:47+0000", "story": null, "post_id": "462508190484900_960298997372481", "message": "#2070 I have some friends that are fucking smart. You think I'm just being a typical MIT student. No. I'm talking about International Olympiad Medalist smart. They breeze through all the classes I struggle in and then brush it off like its nothing. They are all so wonderful and amazing, but they give me a complex like none other. I can only dream of being as smart as them but I feel like I've hit this barrier. What I get done in 5 hours, they get done in 1. And yeah you can say all the bullshit about how it doesn't matter how accomplished or smart you are and how no one really cares after MIT, but I can't help but compare, especially as it is right there in my face. I know that any success or failure is my own fault and being bitter about how fucking dumb I am is immature, but I can't help it. Sometimes after staying up late to finish a pset they've already finished 4 hours earlier, I just feel so disgusted with myself. And I know that there's all these study techniques and all these resources available, but really, how much does that help? And I am getting help from my friends, but I just ask them so many questions I'm just frustrated with how dumb I am, regardless of whether or not my friends care. They don't, they're so willing to help it makes me even more angry with how incompetent I am. I'm just a burden, and I don't know what to do with my life, and fuck I'm just a huge fuck-up. Do I even have friends or are they just being nice to me?", "comments": 13, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]