[{"created_time": "2015-11-28T20:52:25+0000", "story": null, "post_id": "462508190484900_976487172420330", "message": "#3023 Hey there #3012.  I'm really into petplay as well.  Send me an email at petplaymit@gmail.com and we can work something out.\n\nLooking forward to it.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T20:51:56+0000", "story": null, "post_id": "462508190484900_976487032420344", "message": "#3020 I am an Evangelical Christian here on campus. I don't hide what I am, and most of my friends here are agnostic or atheist. We all get along just fine. One question I frequently get asked, I would like to address here. The question is, \"why doesn't your church do things to be more fun, accept birth control, cohabitation, female priests, and other serious changes\". People usually add to that how those changes would bring back young people in droves. Lets talk about fun, church is not meant to be fun. Church is about learning how to live your life, and to keep you on the right path. Lectures here are not always fun, but you still go, because you understand their need. People who leave church because it's not, \"fun\", are like people who leave lectures here they paid for, they missed the entire point. Next, accepting homosexuality, cohabitation, female priests, etc, etc. The reason we do not do these things is because all of these things are against the core doctrines of our church. We follow the lessons of the bible, the bible strictly forbids cohabitation and birth control violates the spirit of being open to life. We also forbid them because we empathize putting others before yourself, this includes creating stable working families, where you put the needs of the other members before yourself, even if it is at your own detriment. Cohabitation encourages you to seek your own pleasure, above the needs of others. (There is also plenty of psychological research showing this.) Some people have argued against this from a survival standpoint saying we should do it anyway just to get new members. We are not a popularity contest. Jesus when asked if he was king replied, \"My Kingdom is not of this world\". We are not a worldly crowd, nor do we want to be. And even if we were, the majority of students here at MIT would not show up anyway. You would all know that we were changing the doctrines in a cynical attempt to bring you. Did you know there are many new protestant sects that accept homosexuality, female priests, cohabitation, and other things? If you ask why you haven't heard of them it's because they collapse almost as fast as they rise. People stay faithful because faith challenges them, not tells them what they want to hear. What we actually do in my hometown is lead a strict, but loving congre", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T20:50:45+0000", "story": null, "post_id": "462508190484900_976486639087050", "message": "#3018 I was taken advantage of while drunk at a party, but I don't think anyone will believe me or care because I'm a guy. It wasn't like I was viciously raped, but if I was sober, I wouldn't have had sex.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T20:50:20+0000", "story": null, "post_id": "462508190484900_976486522420395", "message": "#3017 My roommate left for thanksgiving break. I have been sleeping in her bed because I miss her.", "comments": 18, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T20:50:11+0000", "story": null, "post_id": "462508190484900_976486492420398", "message": "#3016 I'm in love with a guy in my friend group but I'm also close friends with his ex. Part of me wants to see if anything can develop between me and him, but I know that she would be upset if we dated. I should let it go and just stay friends with him. But I don't know if I can...", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T07:40:13+0000", "story": null, "post_id": "462508190484900_976210625781318", "message": "#3013 all this talk about christopher columbus lately... what does he have to do with thanksgiving/native americans? the dude never even landed on north america...", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T07:39:24+0000", "story": null, "post_id": "462508190484900_976210409114673", "message": "#3009 You know you've been at MIT for too long when you get sick of Area Four.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-28T07:39:02+0000", "story": null, "post_id": "462508190484900_976210359114678", "message": "#3007 Rob Miller and Max Goldman are actually really great professors who helped me when I had a question and care a lot about their students!", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]