[{"created_time": "2016-02-12T20:18:02+0000", "story": null, "post_id": "462508190484900_1017716254964088", "message": "#3707 If you tell me you’re a Bernie Sander’s supporter, I automatically assume you either don’t have a firm grasp on the political process, have never paid substantial taxes, and are willfully deluding yourself that he is anything more than a catchy sound byte.", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:17:31+0000", "story": null, "post_id": "462508190484900_1017715968297450", "message": "#3705 If you see this confession while scrolling, you have been visited by the Salty Spirit of Singleness. Loneliness and cash savings will come to you on February 14th, but only if you post \"Happy Singles Awareness Day!\" in the comments.", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:16:06+0000", "story": null, "post_id": "462508190484900_1017715371630843", "message": "#3698 i love my roommate. i do. but i think i'm beginning to harbor some resentment towards her. sometimes i feel like she's not there for me when i need her most, but also money is a thing that i just can't get out of my head. as similar as we are we're not at all from the same class and that's become more and more noticeable over the three years we've lived together. whether it's care packages from her parents or knowing that she feels perfectly at home in a fancy restaurant while i squirm in my seat, it still ends up making me feel like nothing and then i start to hate her for that. i know it's not her fault. it's not mine either. it just is. and as much as i don't want to consider leaving my best bud after all these years, i just don't think i can do it anymore.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:14:35+0000", "story": null, "post_id": "462508190484900_1017714658297581", "message": "#3692 That Coldplay Beyonce song. it's the same old stereotypes of a mystical third-world India where people are always thowing colors at each other. I like the song, but I'm tired of my culture being a backdrop for american pop songs.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:13:58+0000", "story": null, "post_id": "462508190484900_1017714254964288", "message": "#3689 Obsessed with my former 002 TA. I think you still are one but I see you working upstairs too, do you do like all the course 6 labs? Cannot stop day dreaming about you across my lab bench...", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:12:57+0000", "story": null, "post_id": "462508190484900_1017713298297717", "message": "#3685 It's so hard choosing a major! I kind of want to be Course 6-3, but I don't really like 042 and the mathy parts. Kind of want to be Course 14 or Course 15-2 with like the internet/software aspects of Course 6,  but can't make up my mind~~jobs,grad school, internships, i don't know what to do :(", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T20:12:29+0000", "story": null, "post_id": "462508190484900_1017712941631086", "message": "#3683 Anyone else think the term \"leftist\" is weird? I've never heard the term \"rightist\". \n\nAlso the whole using political labels as if they're offensive words (on both sides) is kind of weird (though I've mostly seen them used negatively from the conservative side). Like, I wouldn't be offended to be called a democrat or republican if I was either, because that's already how I self identify.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T02:18:44+0000", "story": null, "post_id": "462508190484900_1017337991668581", "message": "#3675 I'm sick and tired of my friend discussing her Pi Phi events....", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T02:16:27+0000", "story": null, "post_id": "462508190484900_1017337365001977", "message": "#3667 There's this guy I really really really like who's basically just perfection personified. He claims to like me back, but he's sooo bad at responding to my messages. I just counted, and in the last time period I've sent him 45 messages and he's only sent me 3 in reply!! No matter how many facebook stickers I send him, even gifs telling him he's my one and only, he never responds! What a dick!", "comments": 12, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T02:16:17+0000", "story": null, "post_id": "462508190484900_1017337298335317", "message": "#3666 I'm in a long-distance relationship right now, but it's hard remembering how it feels to physically be with that person, and easy to think it's better off being single when we're apart.  I want to be with her so badly, I see a future with her but I don't know how we'll make it in the short-term.  If we break up I'm afraid I won't find another relationship as fulfilling and I'll lose the one for me.  How do we make it work?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T02:13:24+0000", "story": null, "post_id": "462508190484900_1017336595002054", "message": "#3657 If America is to work for us, how well will it work out when those placed in a higher tax bracket realize it's not worth working so hard anymore due to having pay for \"free school\", medical, and other so called benefits that hard working Americans are taxed for. It's only a matter of time until this country is run further into the ground. Nothing is for free, there are no breaks in life. Those who work insane amount of hours to achieve only the best possible outcome and accept nothing worse than very well know how it is. Capitalism is the reason Facebook is here, the reason you have smartphones, and food on your table. Don't like it? Leave the country. \"The only problem with socialism, is eventually you run out of other people's money.\" - Margaret Thatcher", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T01:59:00+0000", "story": null, "post_id": "462508190484900_1017329005002813", "message": "#3642 Two people just dropped out of MIT to start a \"machine intelligence\" company on the west coast without a product or even a prototype. I think they're absolutely crazy. How the hell do they think they'll be able to compete with the Googles and Facebooks and Microsofts of the world? Sooner or later it will hit 'em hard, and I'm sure they'll be back on campus with their tails between their legs. #realitycheck", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T01:58:46+0000", "story": null, "post_id": "462508190484900_1017328915002822", "message": "#3641 Just curious, how can I be part of MIT Confessions admin?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-12T01:57:59+0000", "story": null, "post_id": "462508190484900_1017328735002840", "message": "#3636 I love it when there are ten trillion and one MIT confessions posted, even if the SNR is way way low. It still beats the rest of Facebook...", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]