[{"created_time": "2016-02-10T19:50:27+0000", "story": null, "post_id": "462508190484900_1016678818401165", "message": "#3618 To my 18.03 TA: I apologize for my PSET... I can't control where my ejaculate lands and I'm sure as hell not copying over my work... Don't worry... It's dry...", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T19:49:32+0000", "story": null, "post_id": "462508190484900_1016678301734550", "message": "#3614 To the nice lady shamelessly displaying her unshaved genitalia in the locker room (Wang Fitness), thank you for putting an end to my bi-curious phase. Now I am sure I am no lesbo. 100% sure.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T19:49:00+0000", "story": null, "post_id": "462508190484900_1016678075067906", "message": "#3612 It's the second week of classes and it's already pretty overwhelming...\n\nshit sucks, yo", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:47:11+0000", "story": null, "post_id": "462508190484900_1016319688437078", "message": "#3606 I really wish someone would tag me in the comments of a snarky confession but none of my friends use facebook much.", "comments": 8, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:45:07+0000", "story": null, "post_id": "462508190484900_1016319141770466", "message": "#3596 The other day I saw some heart-felt papers around the image of Angela Davis in Lobby 10, saying how their family members were deeply hurt by her ideology, and the things she preached. I found it very moving, I did some googling, and I can see that it sounds true. \n\nTo that person on campus: thank you for speaking up against something you found unfit and hurting you and group of others on campus.\n\nTo those in charge of the display: I am absolutely disappointed by the fact that you have not removed Angela Davis from your display. You speak of being watchful of others' identities, where they come from, what they’ve lived, and you choose to not to follow the ideas you preach. Where I am from, I call that hypocrisy. Shame on you!\n\nAlthough I am sure not many people will like this for fear of being labeled racist, I speak for a number of us at MIT.", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:44:55+0000", "story": null, "post_id": "462508190484900_1016319108437136", "message": "#3595 I think most MIT students are contradictory when it comes to political and social issues. I don't think I've met a person here who does not commit doublethink. Some examples I've seen:\n\n1. Only police should have guns, but cops are fascist assholes.\n\n2. Evolution is true, but everyone is equal.\n\n3. Support equality, but enact affirmative action.\n\n4. Respect all cultures, but Christians are stupid.\n\n5. The death penalty is wrong, but abortion is okay.\n\n6. Capitalism is evil, but check out my new iPhone!\n\n7. Oppression of women is wrong, but Islamists are freedom fighters.\n\nWhy is it that people can hold these contradictory viewpoints? I don't understand if it's because most people are ignorant or if they don't care enough to think these things through.", "comments": 16, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:43:30+0000", "story": null, "post_id": "462508190484900_1016318755103838", "message": "#3588 I am really into furry stuff and want to make friends that are too. Can we please be secretly furry together?", "comments": 4, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:43:12+0000", "story": null, "post_id": "462508190484900_1016318655103848", "message": "#3587 All I really want is to fuck someone. No commitment, no attachment, just a fuck buddy that doesn't care. I think I'm a semi attractive, pretty normal guy (well kempt, popular, not nerdy, etc), but I have no idea how to go about finding a similarly normal, cute girl that just wants to fuck. If you're out there, please let me know how I can find you.", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2016-02-10T04:41:26+0000", "story": null, "post_id": "462508190484900_1016317931770587", "message": "#3578 Can the students in the 2pm 18.03 lecture please stop talking? I can hear you from across the room. Lecture isn't mandatory. Stay home if you're going to talk through it.", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]