[
  {
    "created_time": "2015-03-04T04:25:42+0000",
    "story": null,
    "post_id": "462508190484900_844039268998455",
    "message": "#1643 The tragedy that happened the other day has been weighing on me, much more so than when this type of thing has happened before. I started dealing with depression and self loathing about a year ago, though I've only been honest with myself about it for a much shorter time.\n\nI think what's different about this tragedy for me is that it no longer seems unattached and distant from my life. I don't know everything Matthew was going through, but I know how impossible it can seem to balance horribly difficult academics with family issues, self loathing, and loneliness in the mix. To lose Matthew like this feels like a bitter blow to everyone battling their personal demons, because there's no reason this may not have been me or any of us. \n\nPlease pay attention to one another. I don't care who you are; we aren't so different. We all need support and love and positivity wherever we can get it.\n\nRest in peace Matthew",
    "comments": 2,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-03-04T04:25:07+0000",
    "story": null,
    "post_id": "462508190484900_844039148998467",
    "message": "#1641 I wrote the post saying goodbye to Phoebe last semester.  I can't believe I'm writing one again so soon to say goodbye to Matthew.",
    "comments": 0,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2015-03-04T04:23:17+0000",
    "story": null,
    "post_id": "462508190484900_844038795665169",
    "message": "#1637 I met a guy that moved the woman rights book to the fiction section and got banned from the library.",
    "comments": 4,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  }
]