[{"created_time": "2015-11-11T23:22:03+0000", "story": null, "post_id": "462508190484900_969156096486771", "message": "#2614 I find it amusing that the same people who think the police are all horrible racist monsters also are the ones who think that only the police should have guns.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:21:53+0000", "story": null, "post_id": "462508190484900_969156036486777", "message": "#2613 some people are saying that they're sorry about the disappearance of the tunnel goblins - that they were an important part of mit culture - well can i just say i have no sympathy for that attitude! i was once attacked by one of our fucking precious goblins!! i for one am happy that i have the chance to traverse mit's tunnels without fear! much love to the pretty fairies on the east side, though", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:19:53+0000", "story": null, "post_id": "462508190484900_969155166486864", "message": "#2602 All of the unhappiness people I know have one thing in common. They blame anyone and anything but themselves for their problems. I've been down the blame road too, seeing myself as a victim of person or circumstance. But I found that taking responsibility for everything that happens in your life is difficult at first, then it becomes empowering and makes you a much stronger more capable person. I know that some problems may not be your fault. At the end of the day, only you can solve them by changing yourself, not someone or something else.", "comments": 3, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:19:24+0000", "story": null, "post_id": "462508190484900_969154973153550", "message": "#2600 Yale has recently been trending so much for bad stuff. #suckstosuck", "comments": 0, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:15:15+0000", "story": null, "post_id": "462508190484900_969153756487005", "message": "#2589 I have not been to the ball pit in Simmons since freshman year after an upperclassman told me that people had sex in there. Now I kinda miss that place.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:13:04+0000", "story": null, "post_id": "462508190484900_969153043153743", "message": "#2581 I wish to remove each of President Rafael Reif's teeth with my thumb and forefinger and eat them one by one.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:12:13+0000", "story": null, "post_id": "462508190484900_969152716487109", "message": "#2576 As a nearsighted person, I'm appalled by the continuing prevalence of Halloween costumes that involve eyeglasses.  Does nobody else realize how offensive and insensitive these costumes are to me - a person who has to go through the grueling ordeal of staggering around my room every morning, virtually blind, feeling for my eyeglasses? Surely, the MIT community must recognize that these costumes make a mockery of me and my condition.  \n\nI've spoken to some other individuals who share my disability, and many of them expressed that they do not feel offended by these appropriative costumes.  Yet, their individual offense is neither necessary nor expected for recognizing offensiveness in general.  It doesn't matter whether they're offended, or even whether the majority of nearsighted individuals are offended.  The only thing that matters is that MIT must make a safe learning space for everyone - including me, and including other nearsighted people who are offended by these costumes, who I'm sure exist but just aren't vocal enough to speak up for themselves.  And as the most easily-offended nearsighted individual in this community, I get the privilege of deciding what is or isn't appropriate here.", "comments": 10, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:11:28+0000", "story": null, "post_id": "462508190484900_969152493153798", "message": "#2572 I think the best way to read all these confessions is in the light of a bad joke. For example, the wolf of wall street dealt with some very dark subjects, but made it funny because by watching you understood it was finding a way to laugh at the ugly side of life.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:11:14+0000", "story": null, "post_id": "462508190484900_969152453153802", "message": "#2571 Before I begin, I would like to emphasize that this has nothing to do whatsoever with the Israeli-Palestinian conflict. This confession only has to do with two events I have experienced in the one semester I have been at MIT. I do not have a firm stance on the Israeli- Palestinian conflict. I feel that the complexities of the issue are beyond the scope of my knowledge and experiences. What I do understand a little better, though, is hate, and I am very much anti-hatred. I attribute my strong anti-hatred stance to my grandfather who amazingly escaped Germany during the Holocaust as a child. The rest of his family:mother, father, and older brother, though, could not escape and did not survive. Needless to say, this deeply impacted my grandfather. The most important way he influenced me was through his intolerance for hatred. He taught me that hatred is ignorant and could have a devastating impact if not kept in check. This leads me to two events that, although not unheard of, are very alarming and should not be occurring- especially at MIT. The first occurred a couple weeks ago during office hours. I sat down in an empty chair next to a girl whom I had not seen before. This girl was wearing a hijab. Naturally, I have no idea if she is Palestinian, simply anti-Israel, or what her views are, and quite frankly I could not care less. She's a student at MIT, like me, and she is here to learn, like me. She looked at me, and I smiled (even though the socially-awkward side of me panicked as it does whenever someone looks at me and I had to confirm to myself that my breath didn't smell and that I did shower that day). I did notice, though, that her eyes lingered on the Star of David necklace I was wearing. Without hesitation, she picked up her notes and sat away from me. Obviously, I do not know what she was thinking and maybe she simply could see better further back in the classroom. I did not let this bother me, though if you're reading this, I am sorry if I offended you. The second, more concerning event, happened before the \"Israeli Impunity and the Palestinian Reality\" event. Although I do not agree with the angry and perhaps hateful undertones of this event, I do support free speech and I am happy that students and faculty who are anti-Israel feel safe enough to voice their opinions. I was walking down the Infinite prior to the event; I saw a massive line of people and had no idea what was going on. I asked someone what was going on, and she said \"A talk by Dr. Chomsky on the injustices from bloodthirsty Jews\". As she was saying this, the person she was with looked at my Star of David necklace and then proceeded to say something in Arabic to the woman I was speaking with. The woman then proceeded to loudly and angrily exclaim that I was \"venomous\" and a \"disgusting murderer\" to which others in line turned to us. I was so alarmed and taken aback that I quickly walked away. I even felt unsafe to walk back to my dorm alone later that evening. I do not know whether these people were MIT affiliated or not. I do not feel that students should be censored in their political beliefs. I feel censorship can create an environment that could be deemed unsafe to students. What I do believe, though, is that people should be weary of when their beliefs transform into hatred. I am not Israeli nor do I have a strong opinion on the situation, and I have not even been to Israel. Yet, due to my cultural and religious identity I was verbally attacked in front of many people. I have not been here for a full semester, yet I have already experienced this hatred. I feel unsafe to wear my Star of David necklace that I have been wearing for years let alone discuss this matter. We are all students- most is not all of whom have played no role in this conflict. All student groups should be tolerant of each other's beliefs even if there is disagreement. But no student should be subject to personal discrimination and no student should ever feel that their safety is threatened.", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:10:55+0000", "story": null, "post_id": "462508190484900_969152416487139", "message": "#2570 I like a lot of things, and I don't like a lot of things. Good thing there's a lot of things.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:10:28+0000", "story": null, "post_id": "462508190484900_969152343153813", "message": "#2568 I'm getting confused on the bathroom situation with the transgender movement. Here's my dilemma, you could build a third bathroom, which would suit some, but some in the trans community would find it insulting and want to use the bathroom of their transition gender. The issue there would be, especially with women, some of them would not want someone they perceive as a man in a bathroom with them. So I'm honestly stuck on what solution to advocate.", "comments": 6, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:09:29+0000", "story": null, "post_id": "462508190484900_969152199820494", "message": "#2565 @2529: I don't get it. Sexual attraction (or lack of) is not racist. Since when is it a right to have people be attracted to you?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-11-11T23:08:44+0000", "story": null, "post_id": "462508190484900_969152083153839", "message": "#2562 Why do all white people here make the same dumb ass face when I walk by them in the halls... they purse their lips, because it's too hard to fucking wave or something?", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]