[{"created_time": "2016-10-20T01:09:00+0000", "story": null, "post_id": "462508190484900_1196476100421435", "message": "#8398 I'm a sophomore and I still don't know what Taylor Series are.", "comments": 11, "reactions": {"like": 247, "love": 2, "haha": 10}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T01:07:00+0000", "story": null, "post_id": "462508190484900_1196474927088219", "message": "#8390 Can the people who are submitting B.S. like, \"Ohhh, the feeling of a hard PSet is orgasmic [yada yada yada],\" just please not post? This is a place where we humanize MIT students. You're doing the opposite by saying your 8.012 PSet turns your masochist on (by the way, you freshman have no right to be saying that). Moreover, you're trivializing people's anguish. Fine, call me butt-hurt. I used to think just like you..................until my friend killed himself. One PSet, one exam, or one problem is not going to push someone off the edge, but they do contribute to that sort of shit. Don't dishonor them, and kindly STFU. Kthxbai.", "comments": 3, "reactions": {"like": 5}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T01:05:00+0000", "story": null, "post_id": "462508190484900_1196473983754980", "message": "#8388 I made a comment to friend, that I meant as sort of a joke, and they were hurt by it, which makes me feel guilty cause not the person who usually does that.", "comments": 2, "reactions": {"like": 4}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T01:03:01+0000", "story": null, "post_id": "462508190484900_1196473440421701", "message": "#8384 After a long day at work, Kanye West goes to his Kanye Nest, to take a Kanye Rest. He wakes up feeling his Kanye Best. Then he'll get dressed in his Kanye Vest, and go on a Kanye Quest. He goes to church to get Kanye Blessed, and then to a hotel to be a Kanye Guest. Then he's off to school to take a Kanye Test. But he forgot to brush his teeth, did he run out of Kanye Crest? He then realized his neighbor stole it, what a Kanye Pest.", "comments": 27, "reactions": {"like": 308, "love": 10, "haha": 29}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T01:03:00+0000", "story": null, "post_id": "462508190484900_1196473093755069", "message": "#8381 Dear MIT Housing,\n\nIf you're going to be dicks and catch people who don't leave during one of the way-too-many fire alarms because apparently you haven't fucked over the students enough, at least do it on a weekend when I don't have actual shit to do. Then again, this note assumes you care at all about student welfare, so I guess this note is useless.\n\nSigned,\nAll of MIT", "comments": 6, "reactions": {"like": 47, "haha": 1}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T01:01:00+0000", "story": null, "post_id": "462508190484900_1196472560421789", "message": "#8377 As revenge for borrowing his clothes too many times, my boyfriend wore my yoga pants. He looked better in them than I do T-T", "comments": 2, "reactions": {"like": 21, "haha": 7}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T00:56:00+0000", "story": null, "post_id": "462508190484900_1196469913755387", "message": "#8369 I've been feeling very depressed lately - eating like crap, not talking to my friends, skipping classes, coming home late, sleeping too much or too little, failing tests and psets, surfing youtube rather than doing psets. I wake up with anxiety every single day. I have days when I spend the time I should be psetting curled up in my room or in a nearby bathroom having an anxiety attack, holding my head and waiting for the dark voices to go away. Sometimes they don’t. \n\nPeople don’t seem to notice this change. Why would they? I haven’t made any friends close enough for me to open up to to care or notice. It’s my fault I’m so alone. Yet, why do I feel so sad about this self-made situation. Maybe I’m just weak. In terms of workload, I have it super easy this semester. I’ve only had one or two quizzes this week for midterms, but my other friends have 3 or 4 midterms and psets together. They must be more stressed out than I am, but they’re handling it better than me. I’m probably just weak.\n\nI know that people keep telling me to seek out friends because \"you can't get through MIT alone,\" but talking to people just seems so entirely worthless. Even if I do talk to people, it'll just feel like I'm being a nuisance to them; they won't really care. People only say that they care, but after you bother them too much, you just become an annoyance.\n\nI already tried going to MIT mental health, but I got the same vibe from them. When I told the psychiatrist that I was feeling sad, they pried for more information and I felt very attacked. Can’t they just listen to what I have to say without getting so worked up about it? I understand that it’s their job to make sure that I’m not in any “immediate danger,” but at the same time, couldn’t they see me as a person rather than as just another patient they need to hurry up and fix? They didn’t even seem to be interested in what I was saying when I was happy - listening and nodding with the same bored and distant eyes as all the other people who said they “cared.” They don’t really care; It’s just their job. When my hour is up, they would just tell me to wrap it up and ask for another appointment time. If I can't even open up to the psychiatrist without being judged and possibly sent to a mental hospital for the slightest misstep, who else can I trust? After a few weeks, I just feigned happiness and never went back again to mental health again.\n\nNow I’m more depressed than ever. It’s so hard just getting through every single day. Who am I living for? What am I living for? What’s the point anymore? I don’t know what to do. I can’t ask MIT Mental Health help because they’ll just send me to a mental hospital. I can’t talk to friends because they honestly don’t care and will just find my constant depression annoying. I can’t tell my family because I don’t want them to worry. I’m not doing well with any of my psets, tests, or obligations because I can’t concentrate. But at this rate, it’s so hard to just keep living through every single day with a fake mask of happiness. When is it all going to be over...", "comments": 6, "reactions": {"like": 21, "love": 4, "wow": 1, "sorry": 17, "anger": 1}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}, {"created_time": "2016-10-20T00:56:00+0000", "story": null, "post_id": "462508190484900_1196469793755399", "message": "#8368 Am I the only one who feels overwhelmed by what upperclassmen (and some underclassmen tbh) do? I hear about people making their own businesses/NGO's and doing intensive research and I'm here like ...............................", "comments": 3, "reactions": {"like": 37}, "page_data": {"page_fans": 11685, "page_engaged_users": 2765, "page_views": 5098, "page_consumption": 9460}}]