[{"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617422431660131", "message": "#10280 Does anyone know if there's a Buddhist Association or Club at MIT? Theravada Buddhist to be exact.", "comments": 3, "reactions": {"like": 1}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}, {"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617422851660089", "message": "#10283 @#10222 Dude, think about it, you literally don't even know her. You don't know if she is the cuddling type etc. You just have oneitis. That's not to say that you might not be a good match, but stop projecting your idealized traits onto her and making her out to be some perfect person in your mind because the fact is she isn't. You putting her on a pedestal is only going to fuck up any chances you have because you're going to be clingy and needy and seeking validation from her, and idk her so I can't say whether or not she will like the attention at first but she definitely will not truly care for it in the long run. Realize that she's just another human being, and talk to her. Find out who she really is, and if you love that person then go for it, but realize that the girl in your head is not the girl that exists in real life.", "comments": 1, "reactions": {"like": 5}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}, {"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617418398327201", "message": "#10267 I am genuinely puzzled why the academics at MIT is expected (by students/their parents) to be filtered in such a way that nobody gets offended/hurt. I recently came across a confession where, the OP was considering reporting a HASS class after they had to watch a disturbing movie for it. (It may be appropriate for them to personally skip that particular homework, but I do not believe that the professor is at fault for assigning that movie.)\nOn a similar note, though not directly related to the previous incident: There is a significant amount of people at MIT,  especially in my residence hall, who have beliefs/practices that are scientifically inaccurate and possibly harmful. Our classes cannot openly debunk these beliefs because that would be considered offensive.\nI understand that certain things are taboo, sometimes only in specific cultures, and MIT needs maintain their diversity by making everyone feel welcomed. However, censoring out these things would be like avoiding to face reality and, in an academic setting, this may impair the progress that can potentially be made. Thoughts?\n(It would be ironic if my confession got filtered out for bringing this up :/.)", "comments": 4, "reactions": {"like": 27}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}, {"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617423348326706", "message": "#10285 I've been at MIT for so long.... and all I want over holiday break is for my mom to make me a grilled cheese with tomato soup and watch hallmark movies together. I miss her so much.", "comments": 3, "reactions": {"like": 85, "love": 30, "sorry": 18}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}, {"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617418551660519", "message": "#10268 FFS, tea of teachers.....please stop spamming!", "comments": 1, "reactions": {"like": 6, "love": 1}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}, {"created_time": "2017-12-03T03:30:00+0000", "story": null, "post_id": "462508190484900_1617421151660259", "message": "#10274 \"You're too young to commit yourself to a guy, let me convince you why you should call off your relationship\" says the girl with a long distance boyfriend who sees her twice per year \n\nI wish I could find better friends. But it's my senior year at MIT and I'm too exhausted", "comments": 0, "reactions": {"like": 9, "haha": 1, "sorry": 4}, "page_data": {"page_fans": 18543, "page_engaged_users": 5285, "page_views": 6355, "page_consumption": 24310}}]