[{"created_time": "2015-10-05T16:47:59+0000", "story": null, "post_id": "462508190484900_953750871360627", "message": "#1924 Since I've been here I've felt a bit of culture shock here and there. But not with what I expected. I grew up in a poor family. My dad finished high-school and never went to college, my mom didn't even finish high-school. They had to work 12+ hour shifts 6 or 7 days a week at dead end jobs to support us. I escaped reality by throwing myself into academics and got here as a result. My friends here have been supportive of me but there have been times where we had to deal with different sets of thinking. For example, both my parents smoke, my older brothers also smoke, and they all smoke in the house we live in. When I casually mentioned to my friends that they wouldn't like my house since it smells of heavy tobacco they flipped out and asked how any parent could subject their child to it and told me that I was an \"abuse victim\". It took a very long, patient, explanation and I want to share it because I feel that a lot of the middle class and rich students here do not get it, quite frankly. Most poor people smoke and are now the majority of smokers. One big reason is poor people don't get weekends, or vacations to a beach house, or yacht club. For many of them, a cigarette is the only break they get. And some people say, well what about 20 - 40 years from now? When you are barely scrapping enough money to pay rent and put food on the table today, 20 years from now is as far from  your mind as it can be. And about smoking in front of me, first of all, second hand smoke isn't nearly as dangerous as smoking itself, and if you read the studies, (I have quite thoroughly.) they admit you have to be around it in an extremely concentrated manner for decades to have any tangible effect. What I had, a few family members who would have a couple smokes after dinner at the table, does not nearly qualify. Also, my parents were both raised by chain smoking parents themselves, so this to them is very normal. What I ask my fellow students is to please stop rushing to judge poor people for not following middle class and wealthy people in lock step, money makes a massive difference. And please don't call me an \"abuse victim\". To compare people smoking cigarettes in front of you to a parent physically harming their child is insulting to people who have had to deal with it.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:46:53+0000", "story": null, "post_id": "462508190484900_953750458027335", "message": "#1918 I want an app that tells me where all the bathrooms at MIT are.", "comments": 7, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:46:27+0000", "story": null, "post_id": "462508190484900_953750338027347", "message": "#1915 Sometimes I have loopy dreams about space and they are still better than Interstellar.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:46:05+0000", "story": null, "post_id": "462508190484900_953750221360692", "message": "#1913 It's truly incredible how many people will not thank or even acknowledge you for holding the door open. This just makes me sad.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:45:27+0000", "story": null, "post_id": "462508190484900_953750004694047", "message": "#1909 Masturbating helps me concentrate on p-sets", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:45:20+0000", "story": null, "post_id": "462508190484900_953749984694049", "message": "#1908 My friends think I'm completely innocent and never even kissed a guy, but I've hooked up with three different guys in the past 3 months. That doesn't seem like much, but when compared to their image of me, it's completely different.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:44:37+0000", "story": null, "post_id": "462508190484900_953749804694067", "message": "#1905 Overheard: \"When a class wants to fuck you, you're allowed to say no.\"", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:44:01+0000", "story": null, "post_id": "462508190484900_953749588027422", "message": "#1901 I feel assaulted and personally victimized every time my phone falls and my headphones get yanked out of my ears, but then I remember that Jesus got through a lot of tough shit, too.", "comments": 2, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:43:02+0000", "story": null, "post_id": "462508190484900_953749268027454", "message": "#1897 MIT has made me develop yellow fever...and I'm completely fine with that.", "comments": 5, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:42:53+0000", "story": null, "post_id": "462508190484900_953749231360791", "message": "#1896 When I show my TA my work and ask what I'm doing wrong and they just answer \"I don't know. You should look over it\" ... I WILL BURN THIS BUILDING TO HE GROUND.", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}, {"created_time": "2015-10-05T16:41:54+0000", "story": null, "post_id": "462508190484900_953748858027495", "message": "#1891 Can't they just spray some green dye on the grass every time they kill it?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 0, "page_engaged_users": 0, "page_views": 0, "page_consumption": 0}}]