[{"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646433495425691", "message": "#11226 How many asian guy, white girl couples are there at MIT?", "comments": 15, "reactions": {"like": 15, "haha": 4}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646432438759130", "message": "#11219 How do you get to know grad students (specifically master students that work in your urop lab) better??? There's this really spicy aero guy and I need some tips", "comments": 5, "reactions": {"like": 4}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646433215425719", "message": "#11224 Does anyone else have stomach pain that gets so bad it is difficult to drink water? I have been dealing with this for well over a year now and it seems to only get worse, I have gone to medical multiple times and only gotten a blood test but nothing has been diagnosed or perscribed and it has been ruining me academically with how often I get sick. I only just managed to get off warning by eating only one meal a day at night so I don't get sick throughout the day. I just don't know what to do and my quality of life is becoming more and more trash and I can't get to a doctor back home. Wtf do I do", "comments": 12, "reactions": {"like": 1, "wow": 1, "sorry": 11}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646431785425862", "message": "#11216 I was just having lunch with a friend who goes to a state school and to the person who thought that those who go to community colleges are a drain on society, you're wrong. Most of my friends from high school are going to community colleges or state schools and I would argue they're more intelligent and aware than some of the hard-headed students at elite colleges are. They're majoring in astrophysics, engineering, etc. One of my friends reads multiple books in a day and another has learning disabilities but is majoring in nursing with straight A's. We seem to think we're better than those who go to state schools and community colleges because we're at MIT or whatever private university in the surrounding area. Maybe we're the ones who need to check ourselves and get out of our bubbles.", "comments": 1, "reactions": {"like": 100, "love": 23, "wow": 3}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646432648759109", "message": "#11220 I just want to send a huge shout out to my main man Kolby Danner. This guy is the bomb.com and he's literally the best, he's been going through some rough times but I know I can always depend on him to pull through, even for some matzas", "comments": 10, "reactions": {"like": 36, "love": 13}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646433358759038", "message": "#11225 Econ friends, which to take: 14.01 or 14.03? Please help", "comments": 3, "reactions": {"like": 2}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646432902092417", "message": "#11222 I would do anything for you. But I didn't do one thing. I didn't ask you out.\nI dreamed of you again last night. This time it was a sad one. It seems I cannot get over you.\n-xyz", "comments": 3, "reactions": {"like": 2, "sorry": 11}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646432142092493", "message": "#11217    01000001    When you said things like, call me “wifey,” when we playfully looked at engagement rings, and at our future house together, I felt so warm and comforted inside, I felt at home. I wish I had shared that more, I wish I had been more vocal. On the other hand, when you unilaterally said that you would leave the country when you were done, or that you expected your partner to be the sole financial provider, I felt no longer part of the conversation, I felt cut out of your future. I wish I shared my insecurities, concerns, and desires, I wish I didn’t pull away. \nI don’t see how a new year can start without you. I don’t see how time can continue without you… For me time has stopped, and I can’t start it up again…   01000001", "comments": 2, "reactions": {"like": 3, "sorry": 11}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646433075425733", "message": "#11223 I kinda love confessions because I can post several times about the same person and the scummy shit they did, leaving everyone else to laugh/ wow react while the posts' subject squirms because they know it's about them.", "comments": 1, "reactions": {"like": 4, "haha": 8, "sorry": 1}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:59:00+0000", "story": null, "post_id": "462508190484900_1646431602092547", "message": "#11215 Can't help but feel like I won't be able to get an internship with my shitty GPA. It looks hard to get by when everything at MIT, from mental health to S3, seems so grade-focused. It's honestly weighing on me, hard, because I don't want to take some \"\"measurement of academic learning\"\" as something with intrinsic value to human worth, yet I can't help but look at my performance and feel like it commandeers my life.\n\nOn the flip-side, I might be naive or ignorant as hell - break my fucking biases (if this is a bias), and show me the light (if it exists).", "comments": 5, "reactions": {"like": 7, "wow": 1, "sorry": 8}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}, {"created_time": "2018-01-01T03:58:00+0000", "story": null, "post_id": "462508190484900_1646428905426150", "message": "#11201 I wish I had someone to cuddle and sleep with at night. Not in a weird way. Just to hug and fall asleep on.", "comments": 12, "reactions": {"like": 42, "love": 14}, "page_data": {"page_fans": 19053, "page_engaged_users": 5566, "page_views": 6518, "page_consumption": 29497}}]