[{"created_time": "2018-04-24T06:30:01+0000", "story": null, "post_id": "462508190484900_1764496390286067", "message": "#13418 Yo sophmores post your Ring delivery pics already so I can tag myself & save the photos", "comments": 0, "reactions": {"like": 2, "love": 2}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:30:00+0000", "story": null, "post_id": "462508190484900_1764496263619413", "message": "#13417 It's actually staggering how much collective time is sunk into confessions. Look at all these posts! People wrote them. Look at all the comments! People wrote them too! Aaaaaah!", "comments": 0, "reactions": {"like": 9}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:29:00+0000", "story": null, "post_id": "462508190484900_1764495840286122", "message": "#13414 I came to MIT to find a place to die. Why? I don't know. I wanted to find a place where no one really knew, so if I died, I wouldn't matter. I still haven't but I waver between accepting this amazing place, and dragging myself to the chopping block. What do you think? Do I finish what I started?", "comments": 2, "reactions": {"like": 1, "sorry": 2}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:26:01+0000", "story": null, "post_id": "462508190484900_1764494086952964", "message": "#13410 Sometimes I wonder if I would be happier if I went to a normal college instead of MIT. Sure, the resources here are top-tier and everything, and the people here are the smartest in the world. But this is the problem. In my high school, I can satisfy myself everyday indulging on the mere thought that I am the smartest person in the school. I can treat people like lesser beings without feeling remorse and take pleasure in the process. If I chose a less well-known college, I may even have a chance to find someone to date, yet everyone here seems far beyond my league. Is it really a good idea to put all the smart people in the same school?", "comments": 9, "reactions": {"like": 10, "haha": 7}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:25:00+0000", "story": null, "post_id": "462508190484900_1764493860286320", "message": "#13409 I really hate bad closures. I often spend a day hanging out with someone and I enjoy basically the entirety of the experience. However, I will say/do something stupid just before we part. Then, without a chance to clarify what I said/did to the other person, I end up being tormented by self-consciousness for the rest of the day. Weekends are worse, since it would be several days before I can see that person again and make sure they are not mad at me. I'm pretty sure they don't even remember the \"act of embarrassment\" I committed, but it still torments me to think about it.", "comments": 1, "reactions": {"like": 7, "sorry": 5}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:21:00+0000", "story": null, "post_id": "462508190484900_1764491316953241", "message": "#13399 I developed a crush on someone about a year ago around this time. The timing was bad, I didn't handle it very well, and it didn't work out. I am dating someone else now, but I can't stop thinking about her. Maybe it's from regret, maybe it's cause I never really got over her, but what I do know for sure is that I need to find a way to get her off my mind. Any advice?", "comments": 1, "reactions": {"like": 2, "sorry": 2, "anger": 1}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}, {"created_time": "2018-04-24T06:19:00+0000", "story": null, "post_id": "462508190484900_1764490373620002", "message": "#13392 I’m a freshman. I feel like I only have 2 real friends in my class and they’re often busy so I just feel alone all the time. Everyone else I’m even slightly close with is a senior and they’re all such amazing people and always make me feel included and happy. I really don’t know what I did to deserve them....I just know that when they’re gone I’ll really be alone and I don’t know how I’m going to handle that.", "comments": 5, "reactions": {"like": 5, "love": 2}, "page_data": {"page_fans": 24186, "page_engaged_users": 2057, "page_views": 1810, "page_consumption": 7109}}]