[{"created_time": "2018-04-19T22:47:00+0000", "story": null, "post_id": "462508190484900_1760253604043679", "message": "#13355 My biggest pet peeve is when my roommates watch Instagram/YouTube videos on their phones without headphones, but turn the volume (to what they think is) just low enough. Dude, if you’re not trying to disturb anyone, put in headphones. You’re not fooling anyone.", "comments": 6, "reactions": {"like": 10, "haha": 3}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}, {"created_time": "2018-04-19T22:43:00+0000", "story": null, "post_id": "462508190484900_1760251090710597", "message": "#13342 I woke up in the middle of the night because of nightmare about mental hospital again.", "comments": 0, "reactions": {"like": 3, "love": 1, "sorry": 4}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}, {"created_time": "2018-04-19T22:42:00+0000", "story": null, "post_id": "462508190484900_1760250577377315", "message": "#13339 I really appreciate the people that are competent and intelligent when it comes to their work and academic stuff but who also know how to chill and laugh at stupid immature jokes. They make it easier to both love this place and deal with the stress", "comments": 7, "reactions": {"like": 19, "love": 5, "anger": 1}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}, {"created_time": "2018-04-19T22:40:00+0000", "story": null, "post_id": "462508190484900_1760249794044060", "message": "#13334 Before I ask this question, I want to make it clear that I'm not trying to attack or defend any side's opinion -- I'm just curious about what people are thinking and how people are thinking. I apologize if this somehow comes off as offensive (but I can also see the comments section becoming a frenzy either way).\n\nAt the moment, I imagine that most, if not a lot, of people find that a person's sexuality very important when it comes to finding a suitable partner to have sexual/emotio nal relations with. I think that, for the most part, it would make sense for a person currently undergoing a sexual transition to eventually disclose to the other party (who may or may not be accepting of a gender transition) that they are in fact transgender. \n\nIf in the near future we were able to undergo gender reassignment surgery so perfect that one wouldn't be able to tell a female born at birth vs. male born at birth -> transitioned into a female, then would it/should it be something to be disclosed to others?", "comments": 1, "reactions": {}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}, {"created_time": "2018-04-19T22:39:00+0000", "story": null, "post_id": "462508190484900_1760249147377458", "message": "#13331 I’m a white male, and my girlfriend is half-Asian, half-white. My goal is to have my children marry someone 50% more Asian than them and so on forever, so that infinitely many generations from now I will be a white man with fully Asian grandchildren.", "comments": 4, "reactions": {"like": 4, "love": 1, "haha": 5}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}, {"created_time": "2018-04-19T22:39:00+0000", "story": null, "post_id": "462508190484900_1760249287377444", "message": "#13332 Find yourself a girl who's a rinsta in the streets and a finsta in the sheets ;)", "comments": 2, "reactions": {"like": 3, "love": 1}, "page_data": {"page_fans": 24151, "page_engaged_users": 975, "page_views": 1042, "page_consumption": 2555}}]