[{"created_time": "2017-03-26T01:50:00+0000", "story": null, "post_id": "462508190484900_1365216290214081", "message": "#9331 What the fuck did you just fucking say about me, you little prefrosh? Ill have you know I graduated top of my class in my high school too, and Ive been involved in numerous secret CIA projects targeting angsty high schoolers like yourself, and I have over 300 confirmed projects on my GitHub. I am trained in archery warfare and Im the top shooter in my entire PE pistol class. You are nothing to me but just another prefrosh. MIT will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me during CPW? Think again, fucker. As we speak I am contacting my secret network of spies across East Campus and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your life. Youre fucking dead, kid. MIT can kill you at anytime, anywhere in over seven hundred ways, and thats just from psets. Not only am I extensively trained to host your egotistical self, but I have access to the entire MIT Class of 2021 Facebook page and I will use it to its full extent to embarrass your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little clever comment was about \"Stanford being better than MIT\" to bring down upon you, maybe you would have held your fucking tongue. But you couldnt, you didnt, and now youre paying the price, you goddamn idiot. MIT will shit fury all over you and you will drown in all of the work you'll have here. Youre fucking dead, kiddo.", "comments": 23, "reactions": {"like": 319, "love": 14, "haha": 58, "sorry": 2}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:48:00+0000", "story": null, "post_id": "462508190484900_1365215470214163", "message": "#9324 If I hear another swimmer say \"AIDS\" or \"cancer\", I'm going to lose it.", "comments": 4, "reactions": {"like": 34, "love": 3}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:47:00+0000", "story": null, "post_id": "462508190484900_1365214833547560", "message": "#9321 So I did the motivation thing where I told myself I couldn't go to the bathroom til I did the pset problem and well that's the story of how I peed my pants as a sober 19 year old", "comments": 2, "reactions": {"like": 128, "wow": 6, "haha": 22, "sorry": 1}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:46:00+0000", "story": null, "post_id": "462508190484900_1365214720214238", "message": "#9320 Me: Sits down to study for the 6.031 exam.  \nMe: Decides that I am no longer trying to get an A in this class.  Me: Suddenly feels so much fucking better about life.", "comments": 8, "reactions": {"like": 57, "love": 2, "haha": 1, "sorry": 2}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:44:00+0000", "story": null, "post_id": "462508190484900_1365213683547675", "message": "#9314 I feel so stupid. I struggle just with a minimal course load. Everyone is off doing UROPS and internships and study abroad, and I'm not doing anything. When I vent people always try to come up with the simplest solutions that only work for their major or for someone who has no reservations/is majorly extroverted. It makes me feel like a very flawed person. \"You just need to do this one basic thing how are you not succeeding\"? Makes me less able to open up to people now. I wonder if I ever made people feel like this in high school when I was actually smart.", "comments": 3, "reactions": {"like": 24, "love": 3, "wow": 2, "sorry": 12}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:43:00+0000", "story": null, "post_id": "462508190484900_1365212793547764", "message": "#9309 People walking by me in the library looking for a place to study rattles me too much. I imagine their beady eyes boring into the back of my head, judging my chrome tabs, my desktop background, my soul. Then again, maybe I should stop watching porn in Barker.", "comments": 1, "reactions": {"like": 16, "haha": 4}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}, {"created_time": "2017-03-26T01:43:00+0000", "story": null, "post_id": "462508190484900_1365213143547729", "message": "#9310 Multiple studies shows that there is a substantial asymmetry in how males and females perceive each others' attractiveness, and that men are much more likely to find women attractive (rather than the other way round).", "comments": 6, "reactions": {"like": 4, "love": 1}, "page_data": {"page_fans": 17001, "page_engaged_users": 2796, "page_views": 1496, "page_consumption": 10599}}]