[
  {
    "created_time": "2016-02-19T00:32:11+0000",
    "story": null,
    "post_id": "462508190484900_1021374454598268",
    "message": "#3879 The issue with modern day social justice techniques:\nI can't tell what is being asked of me.\nI feel like things are more relatable if you ask for some well-defined goal to be met. For example, wanting women to have the right to vote. That is a goal with clear metrics and observable change. It is immediately understood if the goal is met or not.\nNow, a lot of the talk I am exposed to seems so abstract. I hear more about a passionate \"we will overcome this\" mindset than I hear about what metrics are being used. I think, for the sake of everyone, it is better to at least define some goals, even if they are a proxy for what is actually desired. I understand things are complex... But I will only ever live within my own set of experiences, so the more relatable and understandable your problems are to me, the more I will naturally support your side. I feel hesitation and uncertainty when I try to support something that sounds abstract and purely subjective.\nBy the way, I actually think this approach will gain a larger and more diverse following. Instead of focusing on limiting and scolding others for certain actions, focus on asking for a logical, desirable change. I understand it may feel like you are catering to the whims of the privileged with this method, but I believe the mutual understanding and support that can be achieved is more than worth it. The other abstract arguments may follow, but only after spearheading the campaign with clear metrics.",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2016-02-19T00:31:04+0000",
    "story": null,
    "post_id": "462508190484900_1021374151264965",
    "message": "#3873 I visit Stormfront on a daily basis...how many government watch lists does that put me on?",
    "comments": 1,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2016-02-19T00:30:36+0000",
    "story": null,
    "post_id": "462508190484900_1021374011264979",
    "message": "#3870 You know you're coding too much when you accidentally go to Github to order food",
    "comments": 2,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  },
  {
    "created_time": "2016-02-19T00:30:13+0000",
    "story": null,
    "post_id": "462508190484900_1021373964598317",
    "message": "#3869 I am the big spoon. My cat is the little spoon.",
    "comments": 3,
    "reactions": {},
    "page_data": {
      "page_fans": 0,
      "page_engaged_users": 0,
      "page_views": 0,
      "page_consumption": 0
    }
  }
]